#### Terraform Validation & Plan Results
* Terraform Version 📎`1.9.8`
* Working Directory 📂`./tests/e2e`
* Terraform Initialization ⚙️`success`
* Terraform Validation 🤖`success`
* Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Acquiring state lock. This may take a few moments...
[0m[1mmodule.data_management_zone.time_rotating.databricks_account_scim_token_regenerate: Refreshing state... [id=2024-11-20T23:23:22Z][0m
[0m[1mmodule.data_management_zone.module.key_vault_purview.data.azurerm_client_config.current: Reading...[0m[0m
[0m[1mmodule.data_management_zone.data.azurerm_route_table.route_table: Reading...[0m[0m
[0m[1mmodule.data_management_zone.module.purview_account.data.azurerm_client_config.current: Reading...[0m[0m
[0m[1mmodule.data_management_zone.module.key_vault_purview.data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD0zMjBkNmZiNC02NzE2LTQ3OWYtYmQ3Ny1iZjgwZWY1NTliNzQ7b2JqZWN0SWQ9NjEyMDgxZTItYzAzNC00ZDkxLTkxZjgtNTBjNDM5MGZiZjUwO3N1YnNjcmlwdGlvbklkPTY2MGVkMTk2LTlkMDUtNDRmYy1iOTAyLTBjMTFjYTAxNGJkNjt0ZW5hbnRJZD0zNzk2M2RkNC1mNGU2LTQwZjgtYTdkNi0yNGI5NzkxOWU0NTI=][0m
[0m[1mmodule.data_management_zone.data.azurerm_client_config.current: Reading...[0m[0m
[0m[1mmodule.data_management_zone.azurerm_resource_group.scim_rg: Refreshing state... [id=/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/mydmgmt-dev-scim-rg][0m
[0m[1mmodule.data_management_zone.azurerm_resource_group.consumption_adb_rg["westus"]: Refreshing state... [id=/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/mydmgmt-dev-consumption-adb-westus-rg][0m
[0m[1mmodule.data_management_zone.azurerm_resource_group.consumption_adb_rg["northeurope"]: Refreshing state... [id=/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/mydmgmt-dev-consumption-adb-northeurope-rg][0m
[0m[1mmodule.data_management_zone.module.purview_account.data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD0zMjBkNmZiNC02NzE2LTQ3OWYtYmQ3Ny1iZjgwZWY1NTliNzQ7b2JqZWN0SWQ9NjEyMDgxZTItYzAzNC00ZDkxLTkxZjgtNTBjNDM5MGZiZjUwO3N1YnNjcmlwdGlvbklkPTY2MGVkMTk2LTlkMDUtNDRmYy1iOTAyLTBjMTFjYTAxNGJkNjt0ZW5hbnRJZD0zNzk2M2RkNC1mNGU2LTQwZjgtYTdkNi0yNGI5NzkxOWU0NTI=][0m
[0m[1mmodule.data_management_zone.azurerm_resource_group.consumption_synapse_rg: Refreshing state... [id=/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/mydmgmt-dev-consumption-syn-rg][0m
[0m[1mmodule.data_management_zone.data.azurerm_network_security_group.network_security_group: Reading...[0m[0m
[0m[1mmodule.data_management_zone.data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD0zMjBkNmZiNC02NzE2LTQ3OWYtYmQ3Ny1iZjgwZWY1NTliNzQ7b2JqZWN0SWQ9NjEyMDgxZTItYzAzNC00ZDkxLTkxZjgtNTBjNDM5MGZiZjUwO3N1YnNjcmlwdGlvbklkPTY2MGVkMTk2LTlkMDUtNDRmYy1iOTAyLTBjMTFjYTAxNGJkNjt0ZW5hbnRJZD0zNzk2M2RkNC1mNGU2LTQwZjgtYTdkNi0yNGI5NzkxOWU0NTI=][0m
[0m[1mmodule.data_management_zone.azurerm_resource_group.automation_rg: Refreshing state... [id=/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/mydmgmt-dev-automation-rg][0m
[0m[1mmodule.data_management_zone.azurerm_resource_group.governance_rg: Refreshing state... [id=/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/mydmgmt-dev-governance-rg][0m
[0m[1mmodule.data_management_zone.module.key_vault_scim.data.azurerm_client_config.current: Reading...[0m[0m
[0m[1mmodule.data_management_zone.azurerm_resource_group.container_rg: Refreshing state... [id=/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/mydmgmt-dev-container-rg][0m
[0m[1mmodule.data_management_zone.module.key_vault_scim.data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD0zMjBkNmZiNC02NzE2LTQ3OWYtYmQ3Ny1iZjgwZWY1NTliNzQ7b2JqZWN0SWQ9NjEyMDgxZTItYzAzNC00ZDkxLTkxZjgtNTBjNDM5MGZiZjUwO3N1YnNjcmlwdGlvbklkPTY2MGVkMTk2LTlkMDUtNDRmYy1iOTAyLTBjMTFjYTAxNGJkNjt0ZW5hbnRJZD0zNzk2M2RkNC1mNGU2LTQwZjgtYTdkNi0yNGI5NzkxOWU0NTI=][0m
[0m[1mmodule.data_management_zone.data.azurerm_virtual_network.virtual_network: Reading...[0m[0m
[0m[1mmodule.data_management_zone.azurerm_network_security_group.network_security_group_databricks["northeurope"]: Refreshing state... [id=/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/mydmgmt-dev-consumption-adb-northeurope-rg/providers/Microsoft.Network/networkSecurityGroups/mydmgmt-dev-northeurope-nsg001][0m
[0m[1mmodule.data_management_zone.data.azurerm_virtual_network.virtual_network: Read complete after 1s [id=/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/ptt-dev-networking-rg/providers/Microsoft.Network/virtualNetworks/spoke-ptt-dev-vnet001][0m
[0m[1mmodule.data_management_zone.azurerm_network_security_group.network_security_group_databricks["westus"]: Refreshing state... [id=/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/mydmgmt-dev-consumption-adb-westus-rg/providers/Microsoft.Network/networkSecurityGroups/mydmgmt-dev-westus-nsg001][0m
[0m[1mmodule.data_management_zone.azurerm_route_table.route_table_databricks["northeurope"]: Refreshing state... [id=/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/mydmgmt-dev-consumption-adb-northeurope-rg/providers/Microsoft.Network/routeTables/mydmgmt-dev-northeurope-rt001][0m
[0m[1mmodule.data_management_zone.data.azurerm_route_table.route_table: Read complete after 1s [id=/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/ptt-dev-networking-rg/providers/Microsoft.Network/routeTables/ptt-dev-default-rt001][0m
[0m[1mmodule.data_management_zone.azurerm_route_table.route_table_databricks["westus"]: Refreshing state... [id=/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/mydmgmt-dev-consumption-adb-westus-rg/providers/Microsoft.Network/routeTables/mydmgmt-dev-westus-rt001][0m
[0m[1mmodule.data_management_zone.data.azurerm_network_security_group.network_security_group: Read complete after 1s [id=/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/ptt-dev-networking-rg/providers/Microsoft.Network/networkSecurityGroups/ptt-dev-default-nsg001][0m
[0m[1mmodule.data_management_zone.module.databricks_access_connector["northeurope"].azurerm_databricks_access_connector.databricks_access_connector: Refreshing state... [id=/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/mydmgmt-dev-consumption-adb-northeurope-rg/providers/Microsoft.Databricks/accessConnectors/mydmgmt-dev-northeurope-dbac001][0m
[0m[1mmodule.data_management_zone.module.synapse_private_link_hub.azurerm_synapse_private_link_hub.synapse_private_link_hub: Refreshing state... [id=/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/mydmgmt-dev-consumption-syn-rg/providers/Microsoft.Synapse/privateLinkHubs/mydmgmtdevsynplh001][0m
[0m[1mmodule.data_management_zone.module.databricks_access_connector["westus"].azurerm_databricks_access_connector.databricks_access_connector: Refreshing state... [id=/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/mydmgmt-dev-consumption-adb-westus-rg/providers/Microsoft.Databricks/accessConnectors/mydmgmt-dev-westus-dbac001][0m
[0m[1mmodule.data_management_zone.azapi_resource.private_endpoint_subnet: Refreshing state... [id=/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/ptt-dev-networking-rg/providers/Microsoft.Network/virtualNetworks/spoke-ptt-dev-vnet001/subnets/ServicesSubnet][0m
[0m[1mmodule.data_management_zone.module.user_assigned_identity.azurerm_user_assigned_identity.user_assigned_identity: Refreshing state... [id=/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/mydmgmt-dev-automation-rg/providers/Microsoft.ManagedIdentity/userAssignedIdentities/mydmgmt-dev-uai001][0m
[0m[1mmodule.data_management_zone.module.purview_account.azapi_resource.purview_account: Refreshing state... [id=/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/mydmgmt-dev-governance-rg/providers/Microsoft.Purview/accounts/mydmgmt-dev-pview001][0m
[0m[1mmodule.data_management_zone.module.key_vault_purview.azurerm_key_vault.key_vault: Refreshing state... [id=/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/mydmgmt-dev-governance-rg/providers/Microsoft.KeyVault/vaults/mydmgmt-dev-kv001][0m
[0m[1mmodule.data_management_zone.module.key_vault_scim.azurerm_key_vault.key_vault: Refreshing state... [id=/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/mydmgmt-dev-scim-rg/providers/Microsoft.KeyVault/vaults/mydmgmt-dev-kv002][0m
[0m[1mmodule.data_management_zone.module.container_registry.azurerm_container_registry.container_registry: Refreshing state... [id=/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/mydmgmt-dev-container-rg/providers/Microsoft.ContainerRegistry/registries/mydmgmtdevacr001][0m
[0m[1mmodule.data_management_zone.azurerm_virtual_network.virtual_network_databricks["northeurope"]: Refreshing state... [id=/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/mydmgmt-dev-consumption-adb-northeurope-rg/providers/Microsoft.Network/virtualNetworks/mydmgmt-dev-northeurope-vnet001][0m
[0m[1mmodule.data_management_zone.azurerm_virtual_network.virtual_network_databricks["westus"]: Refreshing state... [id=/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/mydmgmt-dev-consumption-adb-westus-rg/providers/Microsoft.Network/virtualNetworks/mydmgmt-dev-westus-vnet001][0m
[0m[1mmodule.data_management_zone.module.databricks_workspace["westus"].azurerm_databricks_workspace.databricks_workspace: Refreshing state... [id=/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/mydmgmt-dev-consumption-adb-westus-rg/providers/Microsoft.Databricks/workspaces/mydmgmt-dev-westus-dbw001][0m
[0m[1mmodule.data_management_zone.module.databricks_workspace["northeurope"].azurerm_databricks_workspace.databricks_workspace: Refreshing state... [id=/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/mydmgmt-dev-consumption-adb-northeurope-rg/providers/Microsoft.Databricks/workspaces/mydmgmt-dev-northeurope-dbw001][0m
[0m[1mmodule.data_management_zone.module.key_vault_purview.data.azurerm_monitor_diagnostic_categories.diagnostic_categories_key_vault: Reading...[0m[0m
[0m[1mmodule.data_management_zone.module.key_vault_purview.azurerm_role_assignment.current_roleassignment_key_vault: Refreshing state... [id=/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/mydmgmt-dev-governance-rg/providers/Microsoft.KeyVault/vaults/mydmgmt-dev-kv001/providers/Microsoft.Authorization/roleAssignments/86495850-85fb-cfa0-22ec-07a3693e922a][0m
[0m[1mmodule.data_management_zone.module.container_registry.data.azurerm_monitor_diagnostic_categories.diagnostic_categories_container_registry: Reading...[0m[0m
[0m[1mmodule.data_management_zone.module.key_vault_purview.azurerm_private_endpoint.private_endpoint_cognitive_account_vault: Refreshing state... [id=/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/mydmgmt-dev-governance-rg/providers/Microsoft.Network/privateEndpoints/mydmgmt-dev-kv001-vault-pe][0m
[0m[1mmodule.data_management_zone.module.synapse_private_link_hub.azurerm_private_endpoint.private_endpoint_synapse_private_link_hub_web: Refreshing state... [id=/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/mydmgmt-dev-consumption-syn-rg/providers/Microsoft.Network/privateEndpoints/mydmgmtdevsynplh001-web-pe][0m
[0m[1mmodule.data_management_zone.module.container_registry.azurerm_private_endpoint.container_registry_private_endpoint: Refreshing state... [id=/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/mydmgmt-dev-container-rg/providers/Microsoft.Network/privateEndpoints/mydmgmtdevacr001-registry-pe][0m
[0m[1mmodule.data_management_zone.module.key_vault_purview.data.azurerm_monitor_diagnostic_categories.diagnostic_categories_key_vault: Read complete after 0s [id=/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/mydmgmt-dev-governance-rg/providers/Microsoft.KeyVault/vaults/mydmgmt-dev-kv001][0m
[0m[1mmodule.data_management_zone.module.key_vault_purview.azurerm_monitor_diagnostic_setting.diagnostic_setting_key_vault["0"]: Refreshing state... [id=/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/mydmgmt-dev-governance-rg/providers/Microsoft.KeyVault/vaults/mydmgmt-dev-kv001|applicationLogs-0][0m
[0m[1mmodule.data_management_zone.module.key_vault_scim.data.azurerm_monitor_diagnostic_categories.diagnostic_categories_key_vault: Reading...[0m[0m
[0m[1mmodule.data_management_zone.module.key_vault_scim.azurerm_role_assignment.current_roleassignment_key_vault: Refreshing state... [id=/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/mydmgmt-dev-scim-rg/providers/Microsoft.KeyVault/vaults/mydmgmt-dev-kv002/providers/Microsoft.Authorization/roleAssignments/d27f2c8e-d31e-174d-9995-e161f4f0ef2c][0m
[0m[1mmodule.data_management_zone.module.container_registry.data.azurerm_monitor_diagnostic_categories.diagnostic_categories_container_registry: Read complete after 0s [id=/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/mydmgmt-dev-container-rg/providers/Microsoft.ContainerRegistry/registries/mydmgmtdevacr001][0m
[0m[1mmodule.data_management_zone.module.key_vault_scim.azurerm_private_endpoint.private_endpoint_cognitive_account_vault: Refreshing state... [id=/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/mydmgmt-dev-scim-rg/providers/Microsoft.Network/privateEndpoints/mydmgmt-dev-kv002-vault-pe][0m
[0m[1mmodule.data_management_zone.module.container_registry.azurerm_monitor_diagnostic_setting.diagnostic_setting_container_registry["0"]: Refreshing state... [id=/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/mydmgmt-dev-container-rg/providers/Microsoft.ContainerRegistry/registries/mydmgmtdevacr001|applicationLogs-0][0m
[0m[1mmodule.data_management_zone.module.purview_account.azurerm_private_endpoint.private_endpoint_purview_account_ingestion_storage_queue: Refreshing state... [id=/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/mydmgmt-dev-governance-rg/providers/Microsoft.Network/privateEndpoints/mydmgmt-dev-pview001-ing-queue-pe][0m
[0m[1mmodule.data_management_zone.module.purview_account.azurerm_private_endpoint.private_endpoint_purview_account_ingestion_storage_blob: Refreshing state... [id=/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/mydmgmt-dev-governance-rg/providers/Microsoft.Network/privateEndpoints/mydmgmt-dev-pview001-ing-blob-pe][0m
[0m[1mmodule.data_management_zone.module.key_vault_scim.data.azurerm_monitor_diagnostic_categories.diagnostic_categories_key_vault: Read complete after 1s [id=/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/mydmgmt-dev-scim-rg/providers/Microsoft.KeyVault/vaults/mydmgmt-dev-kv002][0m
[0m[1mmodule.data_management_zone.module.purview_account.azurerm_private_endpoint.private_endpoint_purview_account_platform: Refreshing state... [id=/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/mydmgmt-dev-governance-rg/providers/Microsoft.Network/privateEndpoints/mydmgmt-dev-pview001-platform-pe][0m
[0m[1mmodule.data_management_zone.module.databricks_workspace["westus"].azurerm_private_endpoint.private_endpoint_databricks_workspace_databricks_ui_api: Refreshing state... [id=/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/mydmgmt-dev-consumption-adb-westus-rg/providers/Microsoft.Network/privateEndpoints/mydmgmt-dev-westus-dbw001-uiapi-pe][0m
[0m[1mmodule.data_management_zone.module.databricks_workspace["northeurope"].azurerm_private_endpoint.private_endpoint_databricks_workspace_databricks_ui_api: Refreshing state... [id=/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/mydmgmt-dev-consumption-adb-northeurope-rg/providers/Microsoft.Network/privateEndpoints/mydmgmt-dev-northeurope-dbw001-uiapi-pe][0m
[0m[1mmodule.data_management_zone.azurerm_role_assignment.purview_roleassignment_key_vault: Refreshing state... [id=/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/mydmgmt-dev-governance-rg/providers/Microsoft.KeyVault/vaults/mydmgmt-dev-kv001/providers/Microsoft.Authorization/roleAssignments/991c703b-f36e-74db-8ba2-0bd82372c7d0][0m
[0m[1mmodule.data_management_zone.module.key_vault_scim.azurerm_monitor_diagnostic_setting.diagnostic_setting_key_vault["0"]: Refreshing state... [id=/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/mydmgmt-dev-scim-rg/providers/Microsoft.KeyVault/vaults/mydmgmt-dev-kv002|applicationLogs-0][0m
[0m[1mmodule.data_management_zone.module.purview_account.azurerm_monitor_diagnostic_setting.diagnostic_setting_purview_account["0"]: Refreshing state... [id=/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/mydmgmt-dev-governance-rg/providers/Microsoft.Purview/accounts/mydmgmt-dev-pview001|applicationLogs-0][0m
[0m[1mmodule.data_management_zone.module.databricks_workspace["westus"].azurerm_monitor_diagnostic_setting.diagnostic_setting_databricks_workspace["0"]: Refreshing state... [id=/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/mydmgmt-dev-consumption-adb-westus-rg/providers/Microsoft.Databricks/workspaces/mydmgmt-dev-westus-dbw001|applicationLogs-0][0m
[0m[1mmodule.data_management_zone.module.databricks_workspace["northeurope"].azurerm_monitor_diagnostic_setting.diagnostic_setting_databricks_workspace["0"]: Refreshing state... [id=/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/mydmgmt-dev-consumption-adb-northeurope-rg/providers/Microsoft.Databricks/workspaces/mydmgmt-dev-northeurope-dbw001|applicationLogs-0][0m
[0m[1mmodule.data_management_zone.module.container_registry.time_sleep.sleep_connectivity: Refreshing state... [id=2024-11-20T23:25:17Z][0m
[0m[1mmodule.data_management_zone.module.synapse_private_link_hub.time_sleep.sleep_connectivity: Refreshing state... [id=2024-11-20T23:24:43Z][0m
[0m[1mmodule.data_management_zone.module.key_vault_purview.time_sleep.sleep_connectivity: Refreshing state... [id=2024-11-20T23:24:56Z][0m
[0m[1mmodule.data_management_zone.module.key_vault_scim.time_sleep.sleep_connectivity: Refreshing state... [id=2024-11-20T23:25:33Z][0m
[0m[1mmodule.data_management_zone.null_resource.databricks_account_scim_token: Refreshing state... [id=5018648542768185060][0m
[0m[1mmodule.data_management_zone.data.azurerm_key_vault_secret.key_vault_secret_databricks_account_scim_token: Reading...[0m[0m
[0m[1mmodule.data_management_zone.data.azurerm_key_vault_secret.key_vault_secret_databricks_account_scim_token: Read complete after 0s [id=https://mydmgmt-dev-kv002.vault.azure.net/secrets/scim-token/28337b79019e4080812322ebfa695854][0m
[0m[1mmodule.data_management_zone.module.purview_account.time_sleep.sleep_connectivity: Refreshing state... [id=2024-11-20T23:27:13Z][0m
[0m[1mmodule.data_management_zone.module.databricks_workspace["northeurope"].azurerm_private_endpoint.private_endpoint_databricks_workspace_browser_authentication[0]: Refreshing state... [id=/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/mydmgmt-dev-consumption-adb-northeurope-rg/providers/Microsoft.Network/privateEndpoints/mydmgmt-dev-northeurope-dbw001-auth-pe][0m
[0m[1mmodule.data_management_zone.module.databricks_workspace["westus"].azurerm_private_endpoint.private_endpoint_databricks_workspace_browser_authentication[0]: Refreshing state... [id=/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/mydmgmt-dev-consumption-adb-westus-rg/providers/Microsoft.Network/privateEndpoints/mydmgmt-dev-westus-dbw001-auth-pe][0m
[0m[1mmodule.data_management_zone.module.databricks_workspace["westus"].time_sleep.sleep_connectivity: Refreshing state... [id=2024-11-20T23:30:45Z][0m
[0m[1mmodule.data_management_zone.module.databricks_workspace["northeurope"].time_sleep.sleep_connectivity: Refreshing state... [id=2024-11-20T23:30:45Z][0m

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  [32m+[0m create[0m
  [33m~[0m update in-place[0m
  [31m-[0m destroy[0m
[31m-[0m/[32m+[0m destroy and then create replacement[0m
 [36m<=[0m read (data resources)[0m

Terraform will perform the following actions:

[1m  # module.data_management_zone.azurerm_network_security_group.network_security_group_databricks["northeurope"][0m must be [1m[31mreplaced[0m
[0m[31m-[0m/[32m+[0m[0m resource "azurerm_network_security_group" "network_security_group_databricks" {
      [33m~[0m[0m id                  = "/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/mydmgmt-dev-consumption-adb-northeurope-rg/providers/Microsoft.Network/networkSecurityGroups/mydmgmt-dev-northeurope-nsg001" -> (known after apply)
        name                = "mydmgmt-dev-northeurope-nsg001"
      [33m~[0m[0m resource_group_name = "mydmgmt-dev-consumption-adb-northeurope-rg" [33m->[0m[0m "mydmgmt-dev-connectivity-adb-northeurope-rg" [31m# forces replacement[0m[0m
      [33m~[0m[0m security_rule       = [
          [31m-[0m[0m {
              [31m-[0m[0m access                                     = "Allow"
              [31m-[0m[0m description                                = "Required for worker communication with Azure Eventhub services."
              [31m-[0m[0m destination_address_prefix                 = "EventHub"
              [31m-[0m[0m destination_address_prefixes               = []
              [31m-[0m[0m destination_application_security_group_ids = []
              [31m-[0m[0m destination_port_range                     = "9093"
              [31m-[0m[0m destination_port_ranges                    = []
              [31m-[0m[0m direction                                  = "Outbound"
              [31m-[0m[0m name                                       = "Microsoft.Databricks-workspaces_UseOnly_databricks-worker-to-eventhub"
              [31m-[0m[0m priority                                   = 103
              [31m-[0m[0m protocol                                   = "Tcp"
              [31m-[0m[0m source_address_prefix                      = "VirtualNetwork"
              [31m-[0m[0m source_address_prefixes                    = []
              [31m-[0m[0m source_application_security_group_ids      = []
              [31m-[0m[0m source_port_range                          = "*"
              [31m-[0m[0m source_port_ranges                         = []
            },
          [31m-[0m[0m {
              [31m-[0m[0m access                                     = "Allow"
              [31m-[0m[0m description                                = "Required for worker nodes communication within a cluster."
              [31m-[0m[0m destination_address_prefix                 = "VirtualNetwork"
              [31m-[0m[0m destination_address_prefixes               = []
              [31m-[0m[0m destination_application_security_group_ids = []
              [31m-[0m[0m destination_port_range                     = "*"
              [31m-[0m[0m destination_port_ranges                    = []
              [31m-[0m[0m direction                                  = "Inbound"
              [31m-[0m[0m name                                       = "Microsoft.Databricks-workspaces_UseOnly_databricks-worker-to-worker-inbound"
              [31m-[0m[0m priority                                   = 100
              [31m-[0m[0m protocol                                   = "*"
              [31m-[0m[0m source_address_prefix                      = "VirtualNetwork"
              [31m-[0m[0m source_address_prefixes                    = []
              [31m-[0m[0m source_application_security_group_ids      = []
              [31m-[0m[0m source_port_range                          = "*"
              [31m-[0m[0m source_port_ranges                         = []
            },
          [31m-[0m[0m {
              [31m-[0m[0m access                                     = "Allow"
              [31m-[0m[0m description                                = "Required for worker nodes communication within a cluster."
              [31m-[0m[0m destination_address_prefix                 = "VirtualNetwork"
              [31m-[0m[0m destination_address_prefixes               = []
              [31m-[0m[0m destination_application_security_group_ids = []
              [31m-[0m[0m destination_port_range                     = "*"
              [31m-[0m[0m destination_port_ranges                    = []
              [31m-[0m[0m direction                                  = "Outbound"
              [31m-[0m[0m name                                       = "Microsoft.Databricks-workspaces_UseOnly_databricks-worker-to-worker-outbound"
              [31m-[0m[0m priority                                   = 100
              [31m-[0m[0m protocol                                   = "*"
              [31m-[0m[0m source_address_prefix                      = "VirtualNetwork"
              [31m-[0m[0m source_address_prefixes                    = []
              [31m-[0m[0m source_application_security_group_ids      = []
              [31m-[0m[0m source_port_range                          = "*"
              [31m-[0m[0m source_port_ranges                         = []
            },
          [31m-[0m[0m {
              [31m-[0m[0m access                                     = "Allow"
              [31m-[0m[0m description                                = "Required for workers communication with Azure SQL services."
              [31m-[0m[0m destination_address_prefix                 = "Sql"
              [31m-[0m[0m destination_address_prefixes               = []
              [31m-[0m[0m destination_application_security_group_ids = []
              [31m-[0m[0m destination_port_range                     = "3306"
              [31m-[0m[0m destination_port_ranges                    = []
              [31m-[0m[0m direction                                  = "Outbound"
              [31m-[0m[0m name                                       = "Microsoft.Databricks-workspaces_UseOnly_databricks-worker-to-sql"
              [31m-[0m[0m priority                                   = 101
              [31m-[0m[0m protocol                                   = "Tcp"
              [31m-[0m[0m source_address_prefix                      = "VirtualNetwork"
              [31m-[0m[0m source_address_prefixes                    = []
              [31m-[0m[0m source_application_security_group_ids      = []
              [31m-[0m[0m source_port_range                          = "*"
              [31m-[0m[0m source_port_ranges                         = []
            },
          [31m-[0m[0m {
              [31m-[0m[0m access                                     = "Allow"
              [31m-[0m[0m description                                = "Required for workers communication with Azure Storage services."
              [31m-[0m[0m destination_address_prefix                 = "Storage"
              [31m-[0m[0m destination_address_prefixes               = []
              [31m-[0m[0m destination_application_security_group_ids = []
              [31m-[0m[0m destination_port_range                     = "443"
              [31m-[0m[0m destination_port_ranges                    = []
              [31m-[0m[0m direction                                  = "Outbound"
              [31m-[0m[0m name                                       = "Microsoft.Databricks-workspaces_UseOnly_databricks-worker-to-storage"
              [31m-[0m[0m priority                                   = 102
              [31m-[0m[0m protocol                                   = "Tcp"
              [31m-[0m[0m source_address_prefix                      = "VirtualNetwork"
              [31m-[0m[0m source_address_prefixes                    = []
              [31m-[0m[0m source_application_security_group_ids      = []
              [31m-[0m[0m source_port_range                          = "*"
              [31m-[0m[0m source_port_ranges                         = []
            },
        ] -> (known after apply)
      [31m-[0m[0m tags                = {} [90m-> null[0m[0m
        [90m# (1 unchanged attribute hidden)[0m[0m
    }

[1m  # module.data_management_zone.azurerm_network_security_group.network_security_group_databricks["westus"][0m must be [1m[31mreplaced[0m
[0m[31m-[0m/[32m+[0m[0m resource "azurerm_network_security_group" "network_security_group_databricks" {
      [33m~[0m[0m id                  = "/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/mydmgmt-dev-consumption-adb-westus-rg/providers/Microsoft.Network/networkSecurityGroups/mydmgmt-dev-westus-nsg001" -> (known after apply)
        name                = "mydmgmt-dev-westus-nsg001"
      [33m~[0m[0m resource_group_name = "mydmgmt-dev-consumption-adb-westus-rg" [33m->[0m[0m "mydmgmt-dev-connectivity-adb-westus-rg" [31m# forces replacement[0m[0m
      [33m~[0m[0m security_rule       = [
          [31m-[0m[0m {
              [31m-[0m[0m access                                     = "Allow"
              [31m-[0m[0m description                                = "Required for worker communication with Azure Eventhub services."
              [31m-[0m[0m destination_address_prefix                 = "EventHub"
              [31m-[0m[0m destination_address_prefixes               = []
              [31m-[0m[0m destination_application_security_group_ids = []
              [31m-[0m[0m destination_port_range                     = "9093"
              [31m-[0m[0m destination_port_ranges                    = []
              [31m-[0m[0m direction                                  = "Outbound"
              [31m-[0m[0m name                                       = "Microsoft.Databricks-workspaces_UseOnly_databricks-worker-to-eventhub"
              [31m-[0m[0m priority                                   = 103
              [31m-[0m[0m protocol                                   = "Tcp"
              [31m-[0m[0m source_address_prefix                      = "VirtualNetwork"
              [31m-[0m[0m source_address_prefixes                    = []
              [31m-[0m[0m source_application_security_group_ids      = []
              [31m-[0m[0m source_port_range                          = "*"
              [31m-[0m[0m source_port_ranges                         = []
            },
          [31m-[0m[0m {
              [31m-[0m[0m access                                     = "Allow"
              [31m-[0m[0m description                                = "Required for worker nodes communication within a cluster."
              [31m-[0m[0m destination_address_prefix                 = "VirtualNetwork"
              [31m-[0m[0m destination_address_prefixes               = []
              [31m-[0m[0m destination_application_security_group_ids = []
              [31m-[0m[0m destination_port_range                     = "*"
              [31m-[0m[0m destination_port_ranges                    = []
              [31m-[0m[0m direction                                  = "Inbound"
              [31m-[0m[0m name                                       = "Microsoft.Databricks-workspaces_UseOnly_databricks-worker-to-worker-inbound"
              [31m-[0m[0m priority                                   = 100
              [31m-[0m[0m protocol                                   = "*"
              [31m-[0m[0m source_address_prefix                      = "VirtualNetwork"
              [31m-[0m[0m source_address_prefixes                    = []
              [31m-[0m[0m source_application_security_group_ids      = []
              [31m-[0m[0m source_port_range                          = "*"
              [31m-[0m[0m source_port_ranges                         = []
            },
          [31m-[0m[0m {
              [31m-[0m[0m access                                     = "Allow"
              [31m-[0m[0m description                                = "Required for worker nodes communication within a cluster."
              [31m-[0m[0m destination_address_prefix                 = "VirtualNetwork"
              [31m-[0m[0m destination_address_prefixes               = []
              [31m-[0m[0m destination_application_security_group_ids = []
              [31m-[0m[0m destination_port_range                     = "*"
              [31m-[0m[0m destination_port_ranges                    = []
              [31m-[0m[0m direction                                  = "Outbound"
              [31m-[0m[0m name                                       = "Microsoft.Databricks-workspaces_UseOnly_databricks-worker-to-worker-outbound"
              [31m-[0m[0m priority                                   = 100
              [31m-[0m[0m protocol                                   = "*"
              [31m-[0m[0m source_address_prefix                      = "VirtualNetwork"
              [31m-[0m[0m source_address_prefixes                    = []
              [31m-[0m[0m source_application_security_group_ids      = []
              [31m-[0m[0m source_port_range                          = "*"
              [31m-[0m[0m source_port_ranges                         = []
            },
          [31m-[0m[0m {
              [31m-[0m[0m access                                     = "Allow"
              [31m-[0m[0m description                                = "Required for workers communication with Azure SQL services."
              [31m-[0m[0m destination_address_prefix                 = "Sql"
              [31m-[0m[0m destination_address_prefixes               = []
              [31m-[0m[0m destination_application_security_group_ids = []
              [31m-[0m[0m destination_port_range                     = "3306"
              [31m-[0m[0m destination_port_ranges                    = []
              [31m-[0m[0m direction                                  = "Outbound"
              [31m-[0m[0m name                                       = "Microsoft.Databricks-workspaces_UseOnly_databricks-worker-to-sql"
              [31m-[0m[0m priority                                   = 101
              [31m-[0m[0m protocol                                   = "Tcp"
              [31m-[0m[0m source_address_prefix                      = "VirtualNetwork"
              [31m-[0m[0m source_address_prefixes                    = []
              [31m-[0m[0m source_application_security_group_ids      = []
              [31m-[0m[0m source_port_range                          = "*"
              [31m-[0m[0m source_port_ranges                         = []
            },
          [31m-[0m[0m {
              [31m-[0m[0m access                                     = "Allow"
              [31m-[0m[0m description                                = "Required for workers communication with Azure Storage services."
              [31m-[0m[0m destination_address_prefix                 = "Storage"
              [31m-[0m[0m destination_address_prefixes               = []
              [31m-[0m[0m destination_application_security_group_ids = []
              [31m-[0m[0m destination_port_range                     = "443"
              [31m-[0m[0m destination_port_ranges                    = []
              [31m-[0m[0m direction                                  = "Outbound"
              [31m-[0m[0m name                                       = "Microsoft.Databricks-workspaces_UseOnly_databricks-worker-to-storage"
              [31m-[0m[0m priority                                   = 102
              [31m-[0m[0m protocol                                   = "Tcp"
              [31m-[0m[0m source_address_prefix                      = "VirtualNetwork"
              [31m-[0m[0m source_address_prefixes                    = []
              [31m-[0m[0m source_application_security_group_ids      = []
              [31m-[0m[0m source_port_range                          = "*"
              [31m-[0m[0m source_port_ranges                         = []
            },
        ] -> (known after apply)
      [31m-[0m[0m tags                = {} [90m-> null[0m[0m
        [90m# (1 unchanged attribute hidden)[0m[0m
    }

[1m  # module.data_management_zone.azurerm_resource_group.connectivity_adb_rg["northeurope"][0m will be created
[0m  [32m+[0m[0m resource "azurerm_resource_group" "connectivity_adb_rg" {
      [32m+[0m[0m id       = (known after apply)
      [32m+[0m[0m location = "northeurope"
      [32m+[0m[0m name     = "mydmgmt-dev-connectivity-adb-northeurope-rg"
    }

[1m  # module.data_management_zone.azurerm_resource_group.connectivity_adb_rg["westus"][0m will be created
[0m  [32m+[0m[0m resource "azurerm_resource_group" "connectivity_adb_rg" {
      [32m+[0m[0m id       = (known after apply)
      [32m+[0m[0m location = "northeurope"
      [32m+[0m[0m name     = "mydmgmt-dev-connectivity-adb-westus-rg"
    }

[1m  # module.data_management_zone.azurerm_resource_group.connectivity_synapse_rg[0m will be created
[0m  [32m+[0m[0m resource "azurerm_resource_group" "connectivity_synapse_rg" {
      [32m+[0m[0m id       = (known after apply)
      [32m+[0m[0m location = "northeurope"
      [32m+[0m[0m name     = "mydmgmt-dev-connectivity-syn-rg"
    }

[1m  # module.data_management_zone.azurerm_resource_group.consumption_adb_rg["northeurope"][0m will be [1m[31mdestroyed[0m
  # (because azurerm_resource_group.consumption_adb_rg is not in configuration)
[0m  [31m-[0m[0m resource "azurerm_resource_group" "consumption_adb_rg" {
      [31m-[0m[0m id         = "/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/mydmgmt-dev-consumption-adb-northeurope-rg" [90m-> null[0m[0m
      [31m-[0m[0m location   = "northeurope" [90m-> null[0m[0m
      [31m-[0m[0m name       = "mydmgmt-dev-consumption-adb-northeurope-rg" [90m-> null[0m[0m
      [31m-[0m[0m tags       = {} [90m-> null[0m[0m
        [90m# (1 unchanged attribute hidden)[0m[0m
    }

[1m  # module.data_management_zone.azurerm_resource_group.consumption_adb_rg["westus"][0m will be [1m[31mdestroyed[0m
  # (because azurerm_resource_group.consumption_adb_rg is not in configuration)
[0m  [31m-[0m[0m resource "azurerm_resource_group" "consumption_adb_rg" {
      [31m-[0m[0m id         = "/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/mydmgmt-dev-consumption-adb-westus-rg" [90m-> null[0m[0m
      [31m-[0m[0m location   = "northeurope" [90m-> null[0m[0m
      [31m-[0m[0m name       = "mydmgmt-dev-consumption-adb-westus-rg" [90m-> null[0m[0m
      [31m-[0m[0m tags       = {} [90m-> null[0m[0m
        [90m# (1 unchanged attribute hidden)[0m[0m
    }

[1m  # module.data_management_zone.azurerm_resource_group.consumption_synapse_rg[0m will be [1m[31mdestroyed[0m
  # (because azurerm_resource_group.consumption_synapse_rg is not in configuration)
[0m  [31m-[0m[0m resource "azurerm_resource_group" "consumption_synapse_rg" {
      [31m-[0m[0m id         = "/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/mydmgmt-dev-consumption-syn-rg" [90m-> null[0m[0m
      [31m-[0m[0m location   = "northeurope" [90m-> null[0m[0m
      [31m-[0m[0m name       = "mydmgmt-dev-consumption-syn-rg" [90m-> null[0m[0m
      [31m-[0m[0m tags       = {} [90m-> null[0m[0m
        [90m# (1 unchanged attribute hidden)[0m[0m
    }

[1m  # module.data_management_zone.azurerm_route_table.route_table_databricks["northeurope"][0m must be [1m[31mreplaced[0m
[0m[31m-[0m/[32m+[0m[0m resource "azurerm_route_table" "route_table_databricks" {
      [33m~[0m[0m id                            = "/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/mydmgmt-dev-consumption-adb-northeurope-rg/providers/Microsoft.Network/routeTables/mydmgmt-dev-northeurope-rt001" -> (known after apply)
        name                          = "mydmgmt-dev-northeurope-rt001"
      [33m~[0m[0m resource_group_name           = "mydmgmt-dev-consumption-adb-northeurope-rg" [33m->[0m[0m "mydmgmt-dev-connectivity-adb-northeurope-rg" [31m# forces replacement[0m[0m
      [33m~[0m[0m subnets                       = [
          [31m-[0m[0m "/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/mydmgmt-dev-consumption-adb-northeurope-rg/providers/Microsoft.Network/virtualNetworks/mydmgmt-dev-northeurope-vnet001/subnets/DatabricksPrivateSubnet",
          [31m-[0m[0m "/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/mydmgmt-dev-consumption-adb-northeurope-rg/providers/Microsoft.Network/virtualNetworks/mydmgmt-dev-northeurope-vnet001/subnets/DatabricksPublicSubnet",
        ] -> (known after apply)
      [31m-[0m[0m tags                          = {} [90m-> null[0m[0m
        [90m# (3 unchanged attributes hidden)[0m[0m
    }

[1m  # module.data_management_zone.azurerm_route_table.route_table_databricks["westus"][0m must be [1m[31mreplaced[0m
[0m[31m-[0m/[32m+[0m[0m resource "azurerm_route_table" "route_table_databricks" {
      [33m~[0m[0m id                            = "/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/mydmgmt-dev-consumption-adb-westus-rg/providers/Microsoft.Network/routeTables/mydmgmt-dev-westus-rt001" -> (known after apply)
        name                          = "mydmgmt-dev-westus-rt001"
      [33m~[0m[0m resource_group_name           = "mydmgmt-dev-consumption-adb-westus-rg" [33m->[0m[0m "mydmgmt-dev-connectivity-adb-westus-rg" [31m# forces replacement[0m[0m
      [33m~[0m[0m subnets                       = [
          [31m-[0m[0m "/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/mydmgmt-dev-consumption-adb-westus-rg/providers/Microsoft.Network/virtualNetworks/mydmgmt-dev-westus-vnet001/subnets/DatabricksPrivateSubnet",
          [31m-[0m[0m "/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/mydmgmt-dev-consumption-adb-westus-rg/providers/Microsoft.Network/virtualNetworks/mydmgmt-dev-westus-vnet001/subnets/DatabricksPublicSubnet",
        ] -> (known after apply)
      [31m-[0m[0m tags                          = {} [90m-> null[0m[0m
        [90m# (3 unchanged attributes hidden)[0m[0m
    }

[1m  # module.data_management_zone.azurerm_virtual_network.virtual_network_databricks["northeurope"][0m must be [1m[31mreplaced[0m
[0m[31m-[0m/[32m+[0m[0m resource "azurerm_virtual_network" "virtual_network_databricks" {
      [31m-[0m[0m flow_timeout_in_minutes = 0 [90m-> null[0m[0m
      [33m~[0m[0m guid                    = "f99d50dd-79b6-40e8-afa9-ab87e605b5b0" -> (known after apply)
      [33m~[0m[0m id                      = "/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/mydmgmt-dev-consumption-adb-northeurope-rg/providers/Microsoft.Network/virtualNetworks/mydmgmt-dev-northeurope-vnet001" -> (known after apply)
        name                    = "mydmgmt-dev-northeurope-vnet001"
      [33m~[0m[0m resource_group_name     = "mydmgmt-dev-consumption-adb-northeurope-rg" [33m->[0m[0m "mydmgmt-dev-connectivity-adb-northeurope-rg" [31m# forces replacement[0m[0m
      [33m~[0m[0m subnet                  = [
          [31m-[0m[0m {
              [31m-[0m[0m address_prefixes                              = [
                  [31m-[0m[0m "10.0.0.0/26",
                ]
              [31m-[0m[0m default_outbound_access_enabled               = true
              [31m-[0m[0m delegation                                    = [
                  [31m-[0m[0m {
                      [31m-[0m[0m name               = "DatabricksDelegation"
                      [31m-[0m[0m service_delegation = [
                          [31m-[0m[0m {
                              [31m-[0m[0m actions = [
                                  [31m-[0m[0m "Microsoft.Network/virtualNetworks/subnets/join/action",
                                  [31m-[0m[0m "Microsoft.Network/virtualNetworks/subnets/prepareNetworkPolicies/action",
                                  [31m-[0m[0m "Microsoft.Network/virtualNetworks/subnets/unprepareNetworkPolicies/action",
                                ]
                              [31m-[0m[0m name    = "Microsoft.Databricks/workspaces"
                            },
                        ]
                    },
                ]
              [31m-[0m[0m id                                            = "/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/mydmgmt-dev-consumption-adb-northeurope-rg/providers/Microsoft.Network/virtualNetworks/mydmgmt-dev-northeurope-vnet001/subnets/DatabricksPrivateSubnet"
              [31m-[0m[0m name                                          = "DatabricksPrivateSubnet"
              [31m-[0m[0m private_endpoint_network_policies             = "Enabled"
              [31m-[0m[0m private_link_service_network_policies_enabled = true
              [31m-[0m[0m route_table_id                                = "/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/mydmgmt-dev-consumption-adb-northeurope-rg/providers/Microsoft.Network/routeTables/mydmgmt-dev-northeurope-rt001"
              [31m-[0m[0m security_group                                = "/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/mydmgmt-dev-consumption-adb-northeurope-rg/providers/Microsoft.Network/networkSecurityGroups/mydmgmt-dev-northeurope-nsg001"
              [31m-[0m[0m service_endpoint_policy_ids                   = []
              [31m-[0m[0m service_endpoints                             = []
            },
          [31m-[0m[0m {
              [31m-[0m[0m address_prefixes                              = [
                  [31m-[0m[0m "10.0.0.64/26",
                ]
              [31m-[0m[0m default_outbound_access_enabled               = true
              [31m-[0m[0m delegation                                    = [
                  [31m-[0m[0m {
                      [31m-[0m[0m name               = "DatabricksDelegation"
                      [31m-[0m[0m service_delegation = [
                          [31m-[0m[0m {
                              [31m-[0m[0m actions = [
                                  [31m-[0m[0m "Microsoft.Network/virtualNetworks/subnets/join/action",
                                  [31m-[0m[0m "Microsoft.Network/virtualNetworks/subnets/prepareNetworkPolicies/action",
                                  [31m-[0m[0m "Microsoft.Network/virtualNetworks/subnets/unprepareNetworkPolicies/action",
                                ]
                              [31m-[0m[0m name    = "Microsoft.Databricks/workspaces"
                            },
                        ]
                    },
                ]
              [31m-[0m[0m id                                            = "/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/mydmgmt-dev-consumption-adb-northeurope-rg/providers/Microsoft.Network/virtualNetworks/mydmgmt-dev-northeurope-vnet001/subnets/DatabricksPublicSubnet"
              [31m-[0m[0m name                                          = "DatabricksPublicSubnet"
              [31m-[0m[0m private_endpoint_network_policies             = "Enabled"
              [31m-[0m[0m private_link_service_network_policies_enabled = true
              [31m-[0m[0m route_table_id                                = "/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/mydmgmt-dev-consumption-adb-northeurope-rg/providers/Microsoft.Network/routeTables/mydmgmt-dev-northeurope-rt001"
              [31m-[0m[0m security_group                                = "/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/mydmgmt-dev-consumption-adb-northeurope-rg/providers/Microsoft.Network/networkSecurityGroups/mydmgmt-dev-northeurope-nsg001"
              [31m-[0m[0m service_endpoint_policy_ids                   = []
              [31m-[0m[0m service_endpoints                             = []
            },
          [32m+[0m[0m {
              [32m+[0m[0m address_prefixes                              = [
                  [32m+[0m[0m "10.0.0.0/26",
                ]
              [32m+[0m[0m default_outbound_access_enabled               = true
              [32m+[0m[0m delegation                                    = [
                  [32m+[0m[0m {
                      [32m+[0m[0m name               = "DatabricksDelegation"
                      [32m+[0m[0m service_delegation = [
                          [32m+[0m[0m {
                              [32m+[0m[0m actions = [
                                  [32m+[0m[0m "Microsoft.Network/virtualNetworks/subnets/join/action",
                                  [32m+[0m[0m "Microsoft.Network/virtualNetworks/subnets/prepareNetworkPolicies/action",
                                  [32m+[0m[0m "Microsoft.Network/virtualNetworks/subnets/unprepareNetworkPolicies/action",
                                ]
                              [32m+[0m[0m name    = "Microsoft.Databricks/workspaces"
                            },
                        ]
                    },
                ]
              [32m+[0m[0m id                                            = (known after apply)
              [32m+[0m[0m name                                          = "DatabricksPrivateSubnet"
              [32m+[0m[0m private_endpoint_network_policies             = "Enabled"
              [32m+[0m[0m private_link_service_network_policies_enabled = true
              [32m+[0m[0m route_table_id                                = (known after apply)
              [32m+[0m[0m security_group                                = (known after apply)
              [32m+[0m[0m service_endpoint_policy_ids                   = []
              [32m+[0m[0m service_endpoints                             = []
            },
          [32m+[0m[0m {
              [32m+[0m[0m address_prefixes                              = [
                  [32m+[0m[0m "10.0.0.64/26",
                ]
              [32m+[0m[0m default_outbound_access_enabled               = true
              [32m+[0m[0m delegation                                    = [
                  [32m+[0m[0m {
                      [32m+[0m[0m name               = "DatabricksDelegation"
                      [32m+[0m[0m service_delegation = [
                          [32m+[0m[0m {
                              [32m+[0m[0m actions = [
                                  [32m+[0m[0m "Microsoft.Network/virtualNetworks/subnets/join/action",
                                  [32m+[0m[0m "Microsoft.Network/virtualNetworks/subnets/prepareNetworkPolicies/action",
                                  [32m+[0m[0m "Microsoft.Network/virtualNetworks/subnets/unprepareNetworkPolicies/action",
                                ]
                              [32m+[0m[0m name    = "Microsoft.Databricks/workspaces"
                            },
                        ]
                    },
                ]
              [32m+[0m[0m id                                            = (known after apply)
              [32m+[0m[0m name                                          = "DatabricksPublicSubnet"
              [32m+[0m[0m private_endpoint_network_policies             = "Enabled"
              [32m+[0m[0m private_link_service_network_policies_enabled = true
              [32m+[0m[0m route_table_id                                = (known after apply)
              [32m+[0m[0m security_group                                = (known after apply)
              [32m+[0m[0m service_endpoint_policy_ids                   = []
              [32m+[0m[0m service_endpoints                             = []
            },
        ]
      [31m-[0m[0m tags                    = {} [90m-> null[0m[0m
        [90m# (5 unchanged attributes hidden)[0m[0m
    }

[1m  # module.data_management_zone.azurerm_virtual_network.virtual_network_databricks["westus"][0m must be [1m[31mreplaced[0m
[0m[31m-[0m/[32m+[0m[0m resource "azurerm_virtual_network" "virtual_network_databricks" {
      [31m-[0m[0m flow_timeout_in_minutes = 0 [90m-> null[0m[0m
      [33m~[0m[0m guid                    = "0d728ff6-d3cb-4c7c-8d15-f8c9a704dfad" -> (known after apply)
      [33m~[0m[0m id                      = "/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/mydmgmt-dev-consumption-adb-westus-rg/providers/Microsoft.Network/virtualNetworks/mydmgmt-dev-westus-vnet001" -> (known after apply)
        name                    = "mydmgmt-dev-westus-vnet001"
      [33m~[0m[0m resource_group_name     = "mydmgmt-dev-consumption-adb-westus-rg" [33m->[0m[0m "mydmgmt-dev-connectivity-adb-westus-rg" [31m# forces replacement[0m[0m
      [33m~[0m[0m subnet                  = [
          [31m-[0m[0m {
              [31m-[0m[0m address_prefixes                              = [
                  [31m-[0m[0m "10.0.0.0/26",
                ]
              [31m-[0m[0m default_outbound_access_enabled               = true
              [31m-[0m[0m delegation                                    = [
                  [31m-[0m[0m {
                      [31m-[0m[0m name               = "DatabricksDelegation"
                      [31m-[0m[0m service_delegation = [
                          [31m-[0m[0m {
                              [31m-[0m[0m actions = [
                                  [31m-[0m[0m "Microsoft.Network/virtualNetworks/subnets/join/action",
                                  [31m-[0m[0m "Microsoft.Network/virtualNetworks/subnets/prepareNetworkPolicies/action",
                                  [31m-[0m[0m "Microsoft.Network/virtualNetworks/subnets/unprepareNetworkPolicies/action",
                                ]
                              [31m-[0m[0m name    = "Microsoft.Databricks/workspaces"
                            },
                        ]
                    },
                ]
              [31m-[0m[0m id                                            = "/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/mydmgmt-dev-consumption-adb-westus-rg/providers/Microsoft.Network/virtualNetworks/mydmgmt-dev-westus-vnet001/subnets/DatabricksPrivateSubnet"
              [31m-[0m[0m name                                          = "DatabricksPrivateSubnet"
              [31m-[0m[0m private_endpoint_network_policies             = "Enabled"
              [31m-[0m[0m private_link_service_network_policies_enabled = true
              [31m-[0m[0m route_table_id                                = "/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/mydmgmt-dev-consumption-adb-westus-rg/providers/Microsoft.Network/routeTables/mydmgmt-dev-westus-rt001"
              [31m-[0m[0m security_group                                = "/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/mydmgmt-dev-consumption-adb-westus-rg/providers/Microsoft.Network/networkSecurityGroups/mydmgmt-dev-westus-nsg001"
              [31m-[0m[0m service_endpoint_policy_ids                   = []
              [31m-[0m[0m service_endpoints                             = []
            },
          [31m-[0m[0m {
              [31m-[0m[0m address_prefixes                              = [
                  [31m-[0m[0m "10.0.0.64/26",
                ]
              [31m-[0m[0m default_outbound_access_enabled               = true
              [31m-[0m[0m delegation                                    = [
                  [31m-[0m[0m {
                      [31m-[0m[0m name               = "DatabricksDelegation"
                      [31m-[0m[0m service_delegation = [
                          [31m-[0m[0m {
                              [31m-[0m[0m actions = [
                                  [31m-[0m[0m "Microsoft.Network/virtualNetworks/subnets/join/action",
                                  [31m-[0m[0m "Microsoft.Network/virtualNetworks/subnets/prepareNetworkPolicies/action",
                                  [31m-[0m[0m "Microsoft.Network/virtualNetworks/subnets/unprepareNetworkPolicies/action",
                                ]
                              [31m-[0m[0m name    = "Microsoft.Databricks/workspaces"
                            },
                        ]
                    },
                ]
              [31m-[0m[0m id                                            = "/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/mydmgmt-dev-consumption-adb-westus-rg/providers/Microsoft.Network/virtualNetworks/mydmgmt-dev-westus-vnet001/subnets/DatabricksPublicSubnet"
              [31m-[0m[0m name                                          = "DatabricksPublicSubnet"
              [31m-[0m[0m private_endpoint_network_policies             = "Enabled"
              [31m-[0m[0m private_link_service_network_policies_enabled = true
              [31m-[0m[0m route_table_id                                = "/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/mydmgmt-dev-consumption-adb-westus-rg/providers/Microsoft.Network/routeTables/mydmgmt-dev-westus-rt001"
              [31m-[0m[0m security_group                                = "/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/mydmgmt-dev-consumption-adb-westus-rg/providers/Microsoft.Network/networkSecurityGroups/mydmgmt-dev-westus-nsg001"
              [31m-[0m[0m service_endpoint_policy_ids                   = []
              [31m-[0m[0m service_endpoints                             = []
            },
          [32m+[0m[0m {
              [32m+[0m[0m address_prefixes                              = [
                  [32m+[0m[0m "10.0.0.0/26",
                ]
              [32m+[0m[0m default_outbound_access_enabled               = true
              [32m+[0m[0m delegation                                    = [
                  [32m+[0m[0m {
                      [32m+[0m[0m name               = "DatabricksDelegation"
                      [32m+[0m[0m service_delegation = [
                          [32m+[0m[0m {
                              [32m+[0m[0m actions = [
                                  [32m+[0m[0m "Microsoft.Network/virtualNetworks/subnets/join/action",
                                  [32m+[0m[0m "Microsoft.Network/virtualNetworks/subnets/prepareNetworkPolicies/action",
                                  [32m+[0m[0m "Microsoft.Network/virtualNetworks/subnets/unprepareNetworkPolicies/action",
                                ]
                              [32m+[0m[0m name    = "Microsoft.Databricks/workspaces"
                            },
                        ]
                    },
                ]
              [32m+[0m[0m id                                            = (known after apply)
              [32m+[0m[0m name                                          = "DatabricksPrivateSubnet"
              [32m+[0m[0m private_endpoint_network_policies             = "Enabled"
              [32m+[0m[0m private_link_service_network_policies_enabled = true
              [32m+[0m[0m route_table_id                                = (known after apply)
              [32m+[0m[0m security_group                                = (known after apply)
              [32m+[0m[0m service_endpoint_policy_ids                   = []
              [32m+[0m[0m service_endpoints                             = []
            },
          [32m+[0m[0m {
              [32m+[0m[0m address_prefixes                              = [
                  [32m+[0m[0m "10.0.0.64/26",
                ]
              [32m+[0m[0m default_outbound_access_enabled               = true
              [32m+[0m[0m delegation                                    = [
                  [32m+[0m[0m {
                      [32m+[0m[0m name               = "DatabricksDelegation"
                      [32m+[0m[0m service_delegation = [
                          [32m+[0m[0m {
                              [32m+[0m[0m actions = [
                                  [32m+[0m[0m "Microsoft.Network/virtualNetworks/subnets/join/action",
                                  [32m+[0m[0m "Microsoft.Network/virtualNetworks/subnets/prepareNetworkPolicies/action",
                                  [32m+[0m[0m "Microsoft.Network/virtualNetworks/subnets/unprepareNetworkPolicies/action",
                                ]
                              [32m+[0m[0m name    = "Microsoft.Databricks/workspaces"
                            },
                        ]
                    },
                ]
              [32m+[0m[0m id                                            = (known after apply)
              [32m+[0m[0m name                                          = "DatabricksPublicSubnet"
              [32m+[0m[0m private_endpoint_network_policies             = "Enabled"
              [32m+[0m[0m private_link_service_network_policies_enabled = true
              [32m+[0m[0m route_table_id                                = (known after apply)
              [32m+[0m[0m security_group                                = (known after apply)
              [32m+[0m[0m service_endpoint_policy_ids                   = []
              [32m+[0m[0m service_endpoints                             = []
            },
        ]
      [31m-[0m[0m tags                    = {} [90m-> null[0m[0m
        [90m# (5 unchanged attributes hidden)[0m[0m
    }

[1m  # module.data_management_zone.module.databricks_access_connector["northeurope"].azurerm_databricks_access_connector.databricks_access_connector[0m must be [1m[31mreplaced[0m
[0m[31m-[0m/[32m+[0m[0m resource "azurerm_databricks_access_connector" "databricks_access_connector" {
      [33m~[0m[0m id                  = "/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/mydmgmt-dev-consumption-adb-northeurope-rg/providers/Microsoft.Databricks/accessConnectors/mydmgmt-dev-northeurope-dbac001" -> (known after apply)
        name                = "mydmgmt-dev-northeurope-dbac001"
      [33m~[0m[0m resource_group_name = "mydmgmt-dev-consumption-adb-northeurope-rg" [33m->[0m[0m "mydmgmt-dev-connectivity-adb-northeurope-rg" [31m# forces replacement[0m[0m
      [31m-[0m[0m tags                = {} [90m-> null[0m[0m
        [90m# (1 unchanged attribute hidden)[0m[0m

      [33m~[0m[0m identity {
          [31m-[0m[0m identity_ids = [] [90m-> null[0m[0m
          [33m~[0m[0m principal_id = "1b07bdf0-8f8d-4841-bf16-353cf1b38e8e" -> (known after apply)
          [33m~[0m[0m tenant_id    = "37963dd4-f4e6-40f8-a7d6-24b97919e452" -> (known after apply)
            [90m# (1 unchanged attribute hidden)[0m[0m
        }
    }

[1m  # module.data_management_zone.module.databricks_access_connector["westus"].azurerm_databricks_access_connector.databricks_access_connector[0m must be [1m[31mreplaced[0m
[0m[31m-[0m/[32m+[0m[0m resource "azurerm_databricks_access_connector" "databricks_access_connector" {
      [33m~[0m[0m id                  = "/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/mydmgmt-dev-consumption-adb-westus-rg/providers/Microsoft.Databricks/accessConnectors/mydmgmt-dev-westus-dbac001" -> (known after apply)
        name                = "mydmgmt-dev-westus-dbac001"
      [33m~[0m[0m resource_group_name = "mydmgmt-dev-consumption-adb-westus-rg" [33m->[0m[0m "mydmgmt-dev-connectivity-adb-westus-rg" [31m# forces replacement[0m[0m
      [31m-[0m[0m tags                = {} [90m-> null[0m[0m
        [90m# (1 unchanged attribute hidden)[0m[0m

      [33m~[0m[0m identity {
          [31m-[0m[0m identity_ids = [] [90m-> null[0m[0m
          [33m~[0m[0m principal_id = "ad267024-d32d-4e9e-a347-8262e2520da7" -> (known after apply)
          [33m~[0m[0m tenant_id    = "37963dd4-f4e6-40f8-a7d6-24b97919e452" -> (known after apply)
            [90m# (1 unchanged attribute hidden)[0m[0m
        }
    }

[1m  # module.data_management_zone.module.databricks_workspace["northeurope"].data.azurerm_monitor_diagnostic_categories.diagnostic_categories_databricks_workspace[0m will be read during apply
  # (config refers to values not yet known)
[0m [36m<=[0m[0m data "azurerm_monitor_diagnostic_categories" "diagnostic_categories_databricks_workspace" {
      [32m+[0m[0m id                  = (known after apply)
      [32m+[0m[0m log_category_groups = (known after apply)
      [32m+[0m[0m log_category_types  = (known after apply)
      [32m+[0m[0m metrics             = (known after apply)
      [32m+[0m[0m resource_id         = (known after apply)
    }

[1m  # module.data_management_zone.module.databricks_workspace["northeurope"].azurerm_databricks_workspace.databricks_workspace[0m must be [1m[31mreplaced[0m
[0m[31m-[0m/[32m+[0m[0m resource "azurerm_databricks_workspace" "databricks_workspace" {
      [33m~[0m[0m access_connector_id                                 = "/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/mydmgmt-dev-consumption-adb-northeurope-rg/providers/Microsoft.Databricks/accessConnectors/mydmgmt-dev-northeurope-dbac001" -> (known after apply)
      [32m+[0m[0m disk_encryption_set_id                              = (known after apply)
      [33m~[0m[0m id                                                  = "/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/mydmgmt-dev-consumption-adb-northeurope-rg/providers/Microsoft.Databricks/workspaces/mydmgmt-dev-northeurope-dbw001" -> (known after apply)
      [31m-[0m[0m managed_disk_cmk_rotation_to_latest_version_enabled = false [90m-> null[0m[0m
      [33m~[0m[0m managed_disk_identity                               = [] -> (known after apply)
      [33m~[0m[0m managed_resource_group_id                           = "/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/mydmgmt-dev-northeurope-dbw001-rg" -> (known after apply)
        name                                                = "mydmgmt-dev-northeurope-dbw001"
      [33m~[0m[0m resource_group_name                                 = "mydmgmt-dev-consumption-adb-northeurope-rg" [33m->[0m[0m "mydmgmt-dev-connectivity-adb-northeurope-rg" [31m# forces replacement[0m[0m
      [33m~[0m[0m storage_account_identity                            = [] -> (known after apply)
      [31m-[0m[0m tags                                                = {} [90m-> null[0m[0m
      [33m~[0m[0m workspace_id                                        = "3950803545660338" -> (known after apply)
      [33m~[0m[0m workspace_url                                       = "adb-3950803545660338.18.azuredatabricks.net" -> (known after apply)
        [90m# (13 unchanged attributes hidden)[0m[0m

      [33m~[0m[0m custom_parameters {
          [32m+[0m[0m nat_gateway_name                                     = (known after apply)
          [33m~[0m[0m private_subnet_network_security_group_association_id = "/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/mydmgmt-dev-consumption-adb-northeurope-rg/providers/Microsoft.Network/virtualNetworks/mydmgmt-dev-northeurope-vnet001/subnets/DatabricksPrivateSubnet" -> (known after apply)
          [33m~[0m[0m public_ip_name                                       = "nat-gw-public-ip" -> (known after apply)
          [33m~[0m[0m public_subnet_network_security_group_association_id  = "/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/mydmgmt-dev-consumption-adb-northeurope-rg/providers/Microsoft.Network/virtualNetworks/mydmgmt-dev-northeurope-vnet001/subnets/DatabricksPublicSubnet" -> (known after apply)
          [33m~[0m[0m storage_account_name                                 = "dbstorage2guztbnlpsnek" -> (known after apply)
          [33m~[0m[0m virtual_network_id                                   = "/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/mydmgmt-dev-consumption-adb-northeurope-rg/providers/Microsoft.Network/virtualNetworks/mydmgmt-dev-northeurope-vnet001" -> (known after apply) [31m# forces replacement[0m[0m
          [33m~[0m[0m vnet_address_prefix                                  = "10.139" -> (known after apply)
            [90m# (5 unchanged attributes hidden)[0m[0m
        }
    }

[1m  # module.data_management_zone.module.databricks_workspace["northeurope"].azurerm_monitor_diagnostic_setting.diagnostic_setting_databricks_workspace["0"][0m must be [1m[31mreplaced[0m
[0m[31m-[0m/[32m+[0m[0m resource "azurerm_monitor_diagnostic_setting" "diagnostic_setting_databricks_workspace" {
      [33m~[0m[0m id                             = "/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/mydmgmt-dev-consumption-adb-northeurope-rg/providers/Microsoft.Databricks/workspaces/mydmgmt-dev-northeurope-dbw001|applicationLogs-0" -> (known after apply)
      [32m+[0m[0m log_analytics_destination_type = (known after apply)
        name                           = "applicationLogs-0"
      [33m~[0m[0m target_resource_id             = "/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/mydmgmt-dev-consumption-adb-northeurope-rg/providers/Microsoft.Databricks/workspaces/mydmgmt-dev-northeurope-dbw001" -> (known after apply) [31m# forces replacement[0m[0m
        [90m# (3 unchanged attributes hidden)[0m[0m

      [33m~[0m[0m enabled_log (known after apply)
      [31m-[0m[0m enabled_log {
          [31m-[0m[0m category_group = "allLogs" [90m-> null[0m[0m
            [90m# (1 unchanged attribute hidden)[0m[0m

          [31m-[0m[0m retention_policy {
              [31m-[0m[0m days    = 0 [90m-> null[0m[0m
              [31m-[0m[0m enabled = false [90m-> null[0m[0m
            }
        }

      [33m~[0m[0m metric (known after apply)
    }

[1m  # module.data_management_zone.module.databricks_workspace["northeurope"].azurerm_private_endpoint.private_endpoint_databricks_workspace_browser_authentication[0][0m must be [1m[31mreplaced[0m
[0m[31m-[0m/[32m+[0m[0m resource "azurerm_private_endpoint" "private_endpoint_databricks_workspace_browser_authentication" {
      [33m~[0m[0m custom_dns_configs            = [] -> (known after apply)
      [33m~[0m[0m id                            = "/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/mydmgmt-dev-consumption-adb-northeurope-rg/providers/Microsoft.Network/privateEndpoints/mydmgmt-dev-northeurope-dbw001-auth-pe" -> (known after apply)
        name                          = "mydmgmt-dev-northeurope-dbw001-auth-pe"
      [33m~[0m[0m network_interface             = [
          [31m-[0m[0m {
              [31m-[0m[0m id   = "/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/mydmgmt-dev-consumption-adb-northeurope-rg/providers/Microsoft.Network/networkInterfaces/mydmgmt-dev-northeurope-dbw001-auth-nic"
              [31m-[0m[0m name = "mydmgmt-dev-northeurope-dbw001-auth-nic"
            },
        ] -> (known after apply)
      [33m~[0m[0m private_dns_zone_configs      = [
          [31m-[0m[0m {
              [31m-[0m[0m id                  = "/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/mydmgmt-dev-consumption-adb-northeurope-rg/providers/Microsoft.Network/privateEndpoints/mydmgmt-dev-northeurope-dbw001-auth-pe/privateDnsZoneGroups/mydmgmt-dev-northeurope-dbw001-arecord/privateDnsZoneConfigs/privatelink.azuredatabricks.net"
              [31m-[0m[0m name                = "privatelink.azuredatabricks.net"
              [31m-[0m[0m private_dns_zone_id = "/subscriptions/e82c5267-9dc4-4f45-ac13-abdd5e130d27/resourceGroups/ptt-dev-privatedns-rg/providers/Microsoft.Network/privateDnsZones/privatelink.azuredatabricks.net"
              [31m-[0m[0m record_sets         = [
                  [31m-[0m[0m {
                      [31m-[0m[0m fqdn         = "northeurope.pl-auth.privatelink.azuredatabricks.net"
                      [31m-[0m[0m ip_addresses = [
                          [31m-[0m[0m "10.1.0.14",
                        ]
                      [31m-[0m[0m name         = "northeurope.pl-auth"
                      [31m-[0m[0m ttl          = 10
                      [31m-[0m[0m type         = "A"
                    },
                  [31m-[0m[0m {
                      [31m-[0m[0m fqdn         = "northeurope-c2.pl-auth.privatelink.azuredatabricks.net"
                      [31m-[0m[0m ip_addresses = [
                          [31m-[0m[0m "10.1.0.15",
                        ]
                      [31m-[0m[0m name         = "northeurope-c2.pl-auth"
                      [31m-[0m[0m ttl          = 10
                      [31m-[0m[0m type         = "A"
                    },
                ]
            },
        ] -> (known after apply)
      [33m~[0m[0m resource_group_name           = "mydmgmt-dev-consumption-adb-northeurope-rg" [33m->[0m[0m "mydmgmt-dev-connectivity-adb-northeurope-rg" [31m# forces replacement[0m[0m
      [31m-[0m[0m tags                          = {} [90m-> null[0m[0m
        [90m# (3 unchanged attributes hidden)[0m[0m

      [33m~[0m[0m private_dns_zone_group {
          [33m~[0m[0m id                   = "/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/mydmgmt-dev-consumption-adb-northeurope-rg/providers/Microsoft.Network/privateEndpoints/mydmgmt-dev-northeurope-dbw001-auth-pe/privateDnsZoneGroups/mydmgmt-dev-northeurope-dbw001-arecord" -> (known after apply)
            name                 = "mydmgmt-dev-northeurope-dbw001-arecord"
            [90m# (1 unchanged attribute hidden)[0m[0m
        }

      [33m~[0m[0m private_service_connection {
            name                              = "mydmgmt-dev-northeurope-dbw001-auth-svc"
          [33m~[0m[0m private_connection_resource_id    = "/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/mydmgmt-dev-consumption-adb-northeurope-rg/providers/Microsoft.Databricks/workspaces/mydmgmt-dev-northeurope-dbw001" -> (known after apply) [31m# forces replacement[0m[0m
          [33m~[0m[0m private_ip_address                = "10.1.0.14" -> (known after apply)
            [90m# (4 unchanged attributes hidden)[0m[0m
        }
    }

[1m  # module.data_management_zone.module.databricks_workspace["northeurope"].azurerm_private_endpoint.private_endpoint_databricks_workspace_databricks_ui_api[0m must be [1m[31mreplaced[0m
[0m[31m-[0m/[32m+[0m[0m resource "azurerm_private_endpoint" "private_endpoint_databricks_workspace_databricks_ui_api" {
      [33m~[0m[0m custom_dns_configs            = [] -> (known after apply)
      [33m~[0m[0m id                            = "/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/mydmgmt-dev-consumption-adb-northeurope-rg/providers/Microsoft.Network/privateEndpoints/mydmgmt-dev-northeurope-dbw001-uiapi-pe" -> (known after apply)
        name                          = "mydmgmt-dev-northeurope-dbw001-uiapi-pe"
      [33m~[0m[0m network_interface             = [
          [31m-[0m[0m {
              [31m-[0m[0m id   = "/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/mydmgmt-dev-consumption-adb-northeurope-rg/providers/Microsoft.Network/networkInterfaces/mydmgmt-dev-northeurope-dbw001-uiapi-nic"
              [31m-[0m[0m name = "mydmgmt-dev-northeurope-dbw001-uiapi-nic"
            },
        ] -> (known after apply)
      [33m~[0m[0m private_dns_zone_configs      = [
          [31m-[0m[0m {
              [31m-[0m[0m id                  = "/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/mydmgmt-dev-consumption-adb-northeurope-rg/providers/Microsoft.Network/privateEndpoints/mydmgmt-dev-northeurope-dbw001-uiapi-pe/privateDnsZoneGroups/mydmgmt-dev-northeurope-dbw001-arecord/privateDnsZoneConfigs/privatelink.azuredatabricks.net"
              [31m-[0m[0m name                = "privatelink.azuredatabricks.net"
              [31m-[0m[0m private_dns_zone_id = "/subscriptions/e82c5267-9dc4-4f45-ac13-abdd5e130d27/resourceGroups/ptt-dev-privatedns-rg/providers/Microsoft.Network/privateDnsZones/privatelink.azuredatabricks.net"
              [31m-[0m[0m record_sets         = [
                  [31m-[0m[0m {
                      [31m-[0m[0m fqdn         = "adb-3950803545660338.18.privatelink.azuredatabricks.net"
                      [31m-[0m[0m ip_addresses = [
                          [31m-[0m[0m "10.1.0.12",
                        ]
                      [31m-[0m[0m name         = "adb-3950803545660338.18"
                      [31m-[0m[0m ttl          = 10
                      [31m-[0m[0m type         = "A"
                    },
                ]
            },
        ] -> (known after apply)
      [33m~[0m[0m resource_group_name           = "mydmgmt-dev-consumption-adb-northeurope-rg" [33m->[0m[0m "mydmgmt-dev-connectivity-adb-northeurope-rg" [31m# forces replacement[0m[0m
      [31m-[0m[0m tags                          = {} [90m-> null[0m[0m
        [90m# (3 unchanged attributes hidden)[0m[0m

      [33m~[0m[0m private_dns_zone_group {
          [33m~[0m[0m id                   = "/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/mydmgmt-dev-consumption-adb-northeurope-rg/providers/Microsoft.Network/privateEndpoints/mydmgmt-dev-northeurope-dbw001-uiapi-pe/privateDnsZoneGroups/mydmgmt-dev-northeurope-dbw001-arecord" -> (known after apply)
            name                 = "mydmgmt-dev-northeurope-dbw001-arecord"
            [90m# (1 unchanged attribute hidden)[0m[0m
        }

      [33m~[0m[0m private_service_connection {
            name                              = "mydmgmt-dev-northeurope-dbw001-uiapi-svc"
          [33m~[0m[0m private_connection_resource_id    = "/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/mydmgmt-dev-consumption-adb-northeurope-rg/providers/Microsoft.Databricks/workspaces/mydmgmt-dev-northeurope-dbw001" -> (known after apply) [31m# forces replacement[0m[0m
          [33m~[0m[0m private_ip_address                = "10.1.0.12" -> (known after apply)
            [90m# (4 unchanged attributes hidden)[0m[0m
        }
    }

[1m  # module.data_management_zone.module.databricks_workspace["westus"].data.azurerm_monitor_diagnostic_categories.diagnostic_categories_databricks_workspace[0m will be read during apply
  # (config refers to values not yet known)
[0m [36m<=[0m[0m data "azurerm_monitor_diagnostic_categories" "diagnostic_categories_databricks_workspace" {
      [32m+[0m[0m id                  = (known after apply)
      [32m+[0m[0m log_category_groups = (known after apply)
      [32m+[0m[0m log_category_types  = (known after apply)
      [32m+[0m[0m metrics             = (known after apply)
      [32m+[0m[0m resource_id         = (known after apply)
    }

[1m  # module.data_management_zone.module.databricks_workspace["westus"].azurerm_databricks_workspace.databricks_workspace[0m must be [1m[31mreplaced[0m
[0m[31m-[0m/[32m+[0m[0m resource "azurerm_databricks_workspace" "databricks_workspace" {
      [33m~[0m[0m access_connector_id                                 = "/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/mydmgmt-dev-consumption-adb-westus-rg/providers/Microsoft.Databricks/accessConnectors/mydmgmt-dev-westus-dbac001" -> (known after apply)
      [32m+[0m[0m disk_encryption_set_id                              = (known after apply)
      [33m~[0m[0m id                                                  = "/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/mydmgmt-dev-consumption-adb-westus-rg/providers/Microsoft.Databricks/workspaces/mydmgmt-dev-westus-dbw001" -> (known after apply)
      [31m-[0m[0m managed_disk_cmk_rotation_to_latest_version_enabled = false [90m-> null[0m[0m
      [33m~[0m[0m managed_disk_identity                               = [] -> (known after apply)
      [33m~[0m[0m managed_resource_group_id                           = "/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/mydmgmt-dev-westus-dbw001-rg" -> (known after apply)
        name                                                = "mydmgmt-dev-westus-dbw001"
      [33m~[0m[0m resource_group_name                                 = "mydmgmt-dev-consumption-adb-westus-rg" [33m->[0m[0m "mydmgmt-dev-connectivity-adb-westus-rg" [31m# forces replacement[0m[0m
      [33m~[0m[0m storage_account_identity                            = [] -> (known after apply)
      [31m-[0m[0m tags                                                = {} [90m-> null[0m[0m
      [33m~[0m[0m workspace_id                                        = "4198687075776623" -> (known after apply)
      [33m~[0m[0m workspace_url                                       = "adb-4198687075776623.3.azuredatabricks.net" -> (known after apply)
        [90m# (13 unchanged attributes hidden)[0m[0m

      [33m~[0m[0m custom_parameters {
          [32m+[0m[0m nat_gateway_name                                     = (known after apply)
          [33m~[0m[0m private_subnet_network_security_group_association_id = "/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/mydmgmt-dev-consumption-adb-westus-rg/providers/Microsoft.Network/virtualNetworks/mydmgmt-dev-westus-vnet001/subnets/DatabricksPrivateSubnet" -> (known after apply)
          [33m~[0m[0m public_ip_name                                       = "nat-gw-public-ip" -> (known after apply)
          [33m~[0m[0m public_subnet_network_security_group_association_id  = "/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/mydmgmt-dev-consumption-adb-westus-rg/providers/Microsoft.Network/virtualNetworks/mydmgmt-dev-westus-vnet001/subnets/DatabricksPublicSubnet" -> (known after apply)
          [33m~[0m[0m storage_account_name                                 = "dbstorageme7nirjeyelbo" -> (known after apply)
          [33m~[0m[0m virtual_network_id                                   = "/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/mydmgmt-dev-consumption-adb-westus-rg/providers/Microsoft.Network/virtualNetworks/mydmgmt-dev-westus-vnet001" -> (known after apply) [31m# forces replacement[0m[0m
          [33m~[0m[0m vnet_address_prefix                                  = "10.139" -> (known after apply)
            [90m# (5 unchanged attributes hidden)[0m[0m
        }
    }

[1m  # module.data_management_zone.module.databricks_workspace["westus"].azurerm_monitor_diagnostic_setting.diagnostic_setting_databricks_workspace["0"][0m must be [1m[31mreplaced[0m
[0m[31m-[0m/[32m+[0m[0m resource "azurerm_monitor_diagnostic_setting" "diagnostic_setting_databricks_workspace" {
      [33m~[0m[0m id                             = "/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/mydmgmt-dev-consumption-adb-westus-rg/providers/Microsoft.Databricks/workspaces/mydmgmt-dev-westus-dbw001|applicationLogs-0" -> (known after apply)
      [32m+[0m[0m log_analytics_destination_type = (known after apply)
        name                           = "applicationLogs-0"
      [33m~[0m[0m target_resource_id             = "/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/mydmgmt-dev-consumption-adb-westus-rg/providers/Microsoft.Databricks/workspaces/mydmgmt-dev-westus-dbw001" -> (known after apply) [31m# forces replacement[0m[0m
        [90m# (3 unchanged attributes hidden)[0m[0m

      [33m~[0m[0m enabled_log (known after apply)
      [31m-[0m[0m enabled_log {
          [31m-[0m[0m category_group = "allLogs" [90m-> null[0m[0m
            [90m# (1 unchanged attribute hidden)[0m[0m

          [31m-[0m[0m retention_policy {
              [31m-[0m[0m days    = 0 [90m-> null[0m[0m
              [31m-[0m[0m enabled = false [90m-> null[0m[0m
            }
        }

      [33m~[0m[0m metric (known after apply)
    }

[1m  # module.data_management_zone.module.databricks_workspace["westus"].azurerm_private_endpoint.private_endpoint_databricks_workspace_browser_authentication[0][0m must be [1m[31mreplaced[0m
[0m[31m-[0m/[32m+[0m[0m resource "azurerm_private_endpoint" "private_endpoint_databricks_workspace_browser_authentication" {
      [33m~[0m[0m custom_dns_configs            = [] -> (known after apply)
      [33m~[0m[0m id                            = "/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/mydmgmt-dev-consumption-adb-westus-rg/providers/Microsoft.Network/privateEndpoints/mydmgmt-dev-westus-dbw001-auth-pe" -> (known after apply)
        name                          = "mydmgmt-dev-westus-dbw001-auth-pe"
      [33m~[0m[0m network_interface             = [
          [31m-[0m[0m {
              [31m-[0m[0m id   = "/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/mydmgmt-dev-consumption-adb-westus-rg/providers/Microsoft.Network/networkInterfaces/mydmgmt-dev-westus-dbw001-auth-nic"
              [31m-[0m[0m name = "mydmgmt-dev-westus-dbw001-auth-nic"
            },
        ] -> (known after apply)
      [33m~[0m[0m private_dns_zone_configs      = [
          [31m-[0m[0m {
              [31m-[0m[0m id                  = "/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/mydmgmt-dev-consumption-adb-westus-rg/providers/Microsoft.Network/privateEndpoints/mydmgmt-dev-westus-dbw001-auth-pe/privateDnsZoneGroups/mydmgmt-dev-westus-dbw001-arecord/privateDnsZoneConfigs/privatelink.azuredatabricks.net"
              [31m-[0m[0m name                = "privatelink.azuredatabricks.net"
              [31m-[0m[0m private_dns_zone_id = "/subscriptions/e82c5267-9dc4-4f45-ac13-abdd5e130d27/resourceGroups/ptt-dev-privatedns-rg/providers/Microsoft.Network/privateDnsZones/privatelink.azuredatabricks.net"
              [31m-[0m[0m record_sets         = [
                  [31m-[0m[0m {
                      [31m-[0m[0m fqdn         = "westus.pl-auth.privatelink.azuredatabricks.net"
                      [31m-[0m[0m ip_addresses = [
                          [31m-[0m[0m "10.1.0.16",
                        ]
                      [31m-[0m[0m name         = "westus.pl-auth"
                      [31m-[0m[0m ttl          = 10
                      [31m-[0m[0m type         = "A"
                    },
                  [31m-[0m[0m {
                      [31m-[0m[0m fqdn         = "westus-c2.pl-auth.privatelink.azuredatabricks.net"
                      [31m-[0m[0m ip_addresses = [
                          [31m-[0m[0m "10.1.0.17",
                        ]
                      [31m-[0m[0m name         = "westus-c2.pl-auth"
                      [31m-[0m[0m ttl          = 10
                      [31m-[0m[0m type         = "A"
                    },
                ]
            },
        ] -> (known after apply)
      [33m~[0m[0m resource_group_name           = "mydmgmt-dev-consumption-adb-westus-rg" [33m->[0m[0m "mydmgmt-dev-connectivity-adb-westus-rg" [31m# forces replacement[0m[0m
      [31m-[0m[0m tags                          = {} [90m-> null[0m[0m
        [90m# (3 unchanged attributes hidden)[0m[0m

      [33m~[0m[0m private_dns_zone_group {
          [33m~[0m[0m id                   = "/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/mydmgmt-dev-consumption-adb-westus-rg/providers/Microsoft.Network/privateEndpoints/mydmgmt-dev-westus-dbw001-auth-pe/privateDnsZoneGroups/mydmgmt-dev-westus-dbw001-arecord" -> (known after apply)
            name                 = "mydmgmt-dev-westus-dbw001-arecord"
            [90m# (1 unchanged attribute hidden)[0m[0m
        }

      [33m~[0m[0m private_service_connection {
            name                              = "mydmgmt-dev-westus-dbw001-auth-svc"
          [33m~[0m[0m private_connection_resource_id    = "/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/mydmgmt-dev-consumption-adb-westus-rg/providers/Microsoft.Databricks/workspaces/mydmgmt-dev-westus-dbw001" -> (known after apply) [31m# forces replacement[0m[0m
          [33m~[0m[0m private_ip_address                = "10.1.0.16" -> (known after apply)
            [90m# (4 unchanged attributes hidden)[0m[0m
        }
    }

[1m  # module.data_management_zone.module.databricks_workspace["westus"].azurerm_private_endpoint.private_endpoint_databricks_workspace_databricks_ui_api[0m must be [1m[31mreplaced[0m
[0m[31m-[0m/[32m+[0m[0m resource "azurerm_private_endpoint" "private_endpoint_databricks_workspace_databricks_ui_api" {
      [33m~[0m[0m custom_dns_configs            = [] -> (known after apply)
      [33m~[0m[0m id                            = "/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/mydmgmt-dev-consumption-adb-westus-rg/providers/Microsoft.Network/privateEndpoints/mydmgmt-dev-westus-dbw001-uiapi-pe" -> (known after apply)
        name                          = "mydmgmt-dev-westus-dbw001-uiapi-pe"
      [33m~[0m[0m network_interface             = [
          [31m-[0m[0m {
              [31m-[0m[0m id   = "/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/mydmgmt-dev-consumption-adb-westus-rg/providers/Microsoft.Network/networkInterfaces/mydmgmt-dev-westus-dbw001-uiapi-nic"
              [31m-[0m[0m name = "mydmgmt-dev-westus-dbw001-uiapi-nic"
            },
        ] -> (known after apply)
      [33m~[0m[0m private_dns_zone_configs      = [
          [31m-[0m[0m {
              [31m-[0m[0m id                  = "/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/mydmgmt-dev-consumption-adb-westus-rg/providers/Microsoft.Network/privateEndpoints/mydmgmt-dev-westus-dbw001-uiapi-pe/privateDnsZoneGroups/mydmgmt-dev-westus-dbw001-arecord/privateDnsZoneConfigs/privatelink.azuredatabricks.net"
              [31m-[0m[0m name                = "privatelink.azuredatabricks.net"
              [31m-[0m[0m private_dns_zone_id = "/subscriptions/e82c5267-9dc4-4f45-ac13-abdd5e130d27/resourceGroups/ptt-dev-privatedns-rg/providers/Microsoft.Network/privateDnsZones/privatelink.azuredatabricks.net"
              [31m-[0m[0m record_sets         = [
                  [31m-[0m[0m {
                      [31m-[0m[0m fqdn         = "adb-4198687075776623.3.privatelink.azuredatabricks.net"
                      [31m-[0m[0m ip_addresses = [
                          [31m-[0m[0m "10.1.0.13",
                        ]
                      [31m-[0m[0m name         = "adb-4198687075776623.3"
                      [31m-[0m[0m ttl          = 10
                      [31m-[0m[0m type         = "A"
                    },
                ]
            },
        ] -> (known after apply)
      [33m~[0m[0m resource_group_name           = "mydmgmt-dev-consumption-adb-westus-rg" [33m->[0m[0m "mydmgmt-dev-connectivity-adb-westus-rg" [31m# forces replacement[0m[0m
      [31m-[0m[0m tags                          = {} [90m-> null[0m[0m
        [90m# (3 unchanged attributes hidden)[0m[0m

      [33m~[0m[0m private_dns_zone_group {
          [33m~[0m[0m id                   = "/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/mydmgmt-dev-consumption-adb-westus-rg/providers/Microsoft.Network/privateEndpoints/mydmgmt-dev-westus-dbw001-uiapi-pe/privateDnsZoneGroups/mydmgmt-dev-westus-dbw001-arecord" -> (known after apply)
            name                 = "mydmgmt-dev-westus-dbw001-arecord"
            [90m# (1 unchanged attribute hidden)[0m[0m
        }

      [33m~[0m[0m private_service_connection {
            name                              = "mydmgmt-dev-westus-dbw001-uiapi-svc"
          [33m~[0m[0m private_connection_resource_id    = "/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/mydmgmt-dev-consumption-adb-westus-rg/providers/Microsoft.Databricks/workspaces/mydmgmt-dev-westus-dbw001" -> (known after apply) [31m# forces replacement[0m[0m
          [33m~[0m[0m private_ip_address                = "10.1.0.13" -> (known after apply)
            [90m# (4 unchanged attributes hidden)[0m[0m
        }
    }

[1m  # module.data_management_zone.module.purview_account.data.azurerm_monitor_diagnostic_categories.diagnostic_categories_purview_account[0m will be read during apply
  # (depends on a resource or a module with changes pending)
[0m [36m<=[0m[0m data "azurerm_monitor_diagnostic_categories" "diagnostic_categories_purview_account" {
      [32m+[0m[0m id                  = (known after apply)
      [32m+[0m[0m log_category_groups = (known after apply)
      [32m+[0m[0m log_category_types  = (known after apply)
      [32m+[0m[0m metrics             = (known after apply)
      [32m+[0m[0m resource_id         = "/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/mydmgmt-dev-governance-rg/providers/Microsoft.Purview/accounts/mydmgmt-dev-pview001"
    }

[1m  # module.data_management_zone.module.purview_account.azapi_resource.purview_account[0m will be updated in-place
[0m  [33m~[0m[0m resource "azapi_resource" "purview_account" {
      [33m~[0m[0m body                      = {
          [33m~[0m[0m properties = {
              [33m~[0m[0m cloudConnectors                     = {
                  [31m-[0m[0m awsExternalId = "ccb61bb5-a6b2-4d8b-a448-0b30c5db6cb3"
                } [33m->[0m[0m [90mnull[0m[0m
                [90m# (6 unchanged attributes hidden)[0m[0m
            }
            [90m# (1 unchanged attribute hidden)[0m[0m
        }
        id                        = "/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/mydmgmt-dev-governance-rg/providers/Microsoft.Purview/accounts/mydmgmt-dev-pview001"
        name                      = "mydmgmt-dev-pview001"
      [33m~[0m[0m output                    = {
          [31m-[0m[0m id         = "/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/mydmgmt-dev-governance-rg/providers/Microsoft.Purview/accounts/mydmgmt-dev-pview001"
          [31m-[0m[0m identity   = {
              [31m-[0m[0m principalId = "f48d78aa-5ae7-4ca8-9f63-ecdf399073eb"
              [31m-[0m[0m tenantId    = "37963dd4-f4e6-40f8-a7d6-24b97919e452"
              [31m-[0m[0m type        = "SystemAssigned"
            }
          [31m-[0m[0m location   = "westus"
          [31m-[0m[0m name       = "mydmgmt-dev-pview001"
          [31m-[0m[0m properties = {
              [31m-[0m[0m accountStatus                       = {
                  [31m-[0m[0m accountProvisioningState = "Succeeded"
                }
              [31m-[0m[0m cloudConnectors                     = {
                  [31m-[0m[0m awsExternalId = "ccb61bb5-a6b2-4d8b-a448-0b30c5db6cb3"
                }
              [31m-[0m[0m createdAt                           = "2024-11-20T23:23:39.2534809Z"
              [31m-[0m[0m createdBy                           = "320d6fb4-6716-479f-bd77-bf80ef559b74"
              [31m-[0m[0m createdByObjectId                   = "612081e2-c034-4d91-91f8-50c4390fbf50"
              [31m-[0m[0m defaultDomain                       = "mydmgmt-dev-pview001"
              [31m-[0m[0m endpoints                           = {
                  [31m-[0m[0m catalog = "https://37963dd4-f4e6-40f8-a7d6-24b97919e452-api.purview-service.microsoft.com/catalog"
                  [31m-[0m[0m scan    = "https://37963dd4-f4e6-40f8-a7d6-24b97919e452-api.purview-service.microsoft.com/scan"
                }
              [31m-[0m[0m friendlyName                        = "mydmgmt-dev-pview001"
              [31m-[0m[0m ingestionStorage                    = {
                  [31m-[0m[0m id                  = "/subscriptions/c86abcfa-2ad1-43ec-8412-4ac039399029/resourceGroups/ingestion-storage-rg-westus-0/providers/Microsoft.Storage/storageAccounts/ingestionwusxsmjetv"
                  [31m-[0m[0m primaryEndpoint     = "https://ingestionwusxsmjetv.z1.blob.storage.azure.net/"
                  [31m-[0m[0m publicNetworkAccess = "Disabled"
                }
              [31m-[0m[0m managedEventHubState                = "Disabled"
              [31m-[0m[0m managedResourcesPublicNetworkAccess = "Disabled"
              [31m-[0m[0m privateEndpointConnections          = [
                  [31m-[0m[0m {
                      [31m-[0m[0m id         = "/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/mydmgmt-dev-governance-rg/providers/Microsoft.Purview/accounts/mydmgmt-dev-pview001/privateEndpointConnections/mydmgmt-dev-pview001-platform-pe-b5e54e23-7c2e-42bd-90a2-4ec503de1600"
                      [31m-[0m[0m name       = "mydmgmt-dev-pview001-platform-pe-b5e54e23-7c2e-42bd-90a2-4ec503de1600"
                      [31m-[0m[0m properties = {
                          [31m-[0m[0m privateEndpoint                   = {
                              [31m-[0m[0m id = "/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/mydmgmt-dev-governance-rg/providers/Microsoft.Network/privateEndpoints/mydmgmt-dev-pview001-platform-pe"
                            }
                          [31m-[0m[0m privateLinkServiceConnectionState = {
                              [31m-[0m[0m actionsRequired = "None"
                              [31m-[0m[0m status          = "Approved"
                            }
                          [31m-[0m[0m provisioningState                 = "Succeeded"
                        }
                      [31m-[0m[0m type       = "Microsoft.Purview/accounts/privateEndpointConnections"
                    },
                ]
              [31m-[0m[0m provisioningState                   = "Succeeded"
              [31m-[0m[0m publicNetworkAccess                 = "Enabled"
              [31m-[0m[0m tenantEndpointState                 = "Enabled"
            }
          [31m-[0m[0m sku        = {
              [31m-[0m[0m capacity = 1
              [31m-[0m[0m name     = "Standard"
            }
          [31m-[0m[0m systemData = {
              [31m-[0m[0m createdAt          = "2024-11-20T23:23:39.2534809Z"
              [31m-[0m[0m createdBy          = "320d6fb4-6716-479f-bd77-bf80ef559b74"
              [31m-[0m[0m createdByType      = "Application"
              [31m-[0m[0m lastModifiedAt     = "2024-11-21T13:15:03.096574Z"
              [31m-[0m[0m lastModifiedBy     = "320d6fb4-6716-479f-bd77-bf80ef559b74"
              [31m-[0m[0m lastModifiedByType = "Application"
            }
          [31m-[0m[0m type       = "Microsoft.Purview/accounts"
        } -> (known after apply)
        tags                      = {}
        [90m# (8 unchanged attributes hidden)[0m[0m

        [90m# (1 unchanged block hidden)[0m[0m
    }

[1m  # module.data_management_zone.module.purview_account.azurerm_monitor_diagnostic_setting.diagnostic_setting_purview_account["0"][0m will be updated in-place
[0m  [33m~[0m[0m resource "azurerm_monitor_diagnostic_setting" "diagnostic_setting_purview_account" {
        id                             = "/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/mydmgmt-dev-governance-rg/providers/Microsoft.Purview/accounts/mydmgmt-dev-pview001|applicationLogs-0"
        name                           = "applicationLogs-0"
        [90m# (5 unchanged attributes hidden)[0m[0m

      [33m~[0m[0m enabled_log (known after apply)
      [31m-[0m[0m enabled_log {
          [31m-[0m[0m category_group = "allLogs" [90m-> null[0m[0m
            [90m# (1 unchanged attribute hidden)[0m[0m

          [31m-[0m[0m retention_policy {
              [31m-[0m[0m days    = 0 [90m-> null[0m[0m
              [31m-[0m[0m enabled = false [90m-> null[0m[0m
            }
        }
      [31m-[0m[0m enabled_log {
          [31m-[0m[0m category_group = "audit" [90m-> null[0m[0m
            [90m# (1 unchanged attribute hidden)[0m[0m

          [31m-[0m[0m retention_policy {
              [31m-[0m[0m days    = 0 [90m-> null[0m[0m
              [31m-[0m[0m enabled = false [90m-> null[0m[0m
            }
        }

      [33m~[0m[0m metric (known after apply)
      [31m-[0m[0m metric {
          [31m-[0m[0m category = "AllMetrics" [90m-> null[0m[0m
          [31m-[0m[0m enabled  = true [90m-> null[0m[0m

          [31m-[0m[0m retention_policy {
              [31m-[0m[0m days    = 0 [90m-> null[0m[0m
              [31m-[0m[0m enabled = false [90m-> null[0m[0m
            }
        }
    }

[1m  # module.data_management_zone.module.purview_account.azurerm_private_endpoint.private_endpoint_purview_account_ingestion_storage_blob[0m must be [1m[31mreplaced[0m
[0m[31m-[0m/[32m+[0m[0m resource "azurerm_private_endpoint" "private_endpoint_purview_account_ingestion_storage_blob" {
      [33m~[0m[0m custom_dns_configs            = [] -> (known after apply)
      [33m~[0m[0m id                            = "/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/mydmgmt-dev-governance-rg/providers/Microsoft.Network/privateEndpoints/mydmgmt-dev-pview001-ing-blob-pe" -> (known after apply)
        name                          = "mydmgmt-dev-pview001-ing-blob-pe"
      [33m~[0m[0m network_interface             = [
          [31m-[0m[0m {
              [31m-[0m[0m id   = "/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/mydmgmt-dev-governance-rg/providers/Microsoft.Network/networkInterfaces/mydmgmt-dev-pview001-ing-blob-nic"
              [31m-[0m[0m name = "mydmgmt-dev-pview001-ing-blob-nic"
            },
        ] -> (known after apply)
      [33m~[0m[0m private_dns_zone_configs      = [
          [31m-[0m[0m {
              [31m-[0m[0m id                  = "/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/mydmgmt-dev-governance-rg/providers/Microsoft.Network/privateEndpoints/mydmgmt-dev-pview001-ing-blob-pe/privateDnsZoneGroups/mydmgmt-dev-pview001-arecord/privateDnsZoneConfigs/privatelink.blob.core.windows.net"
              [31m-[0m[0m name                = "privatelink.blob.core.windows.net"
              [31m-[0m[0m private_dns_zone_id = "/subscriptions/e82c5267-9dc4-4f45-ac13-abdd5e130d27/resourceGroups/ptt-dev-privatedns-rg/providers/Microsoft.Network/privateDnsZones/privatelink.blob.core.windows.net"
              [31m-[0m[0m record_sets         = []
            },
        ] -> (known after apply)
      [31m-[0m[0m tags                          = {} [90m-> null[0m[0m
        [90m# (4 unchanged attributes hidden)[0m[0m

      [33m~[0m[0m private_dns_zone_group {
          [33m~[0m[0m id                   = "/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/mydmgmt-dev-governance-rg/providers/Microsoft.Network/privateEndpoints/mydmgmt-dev-pview001-ing-blob-pe/privateDnsZoneGroups/mydmgmt-dev-pview001-arecord" -> (known after apply)
            name                 = "mydmgmt-dev-pview001-arecord"
            [90m# (1 unchanged attribute hidden)[0m[0m
        }

      [33m~[0m[0m private_service_connection {
            name                              = "mydmgmt-dev-pview001-ing-blob-svc"
          [33m~[0m[0m private_connection_resource_id    = "/subscriptions/c86abcfa-2ad1-43ec-8412-4ac039399029/resourceGroups/ingestion-storage-rg-westus-0/providers/Microsoft.Storage/storageAccounts/ingestionwusxsmjetv" -> (known after apply) [31m# forces replacement[0m[0m
          [33m~[0m[0m private_ip_address                = "10.1.0.9" -> (known after apply)
            [90m# (4 unchanged attributes hidden)[0m[0m
        }
    }

[1m  # module.data_management_zone.module.purview_account.azurerm_private_endpoint.private_endpoint_purview_account_ingestion_storage_queue[0m must be [1m[31mreplaced[0m
[0m[31m-[0m/[32m+[0m[0m resource "azurerm_private_endpoint" "private_endpoint_purview_account_ingestion_storage_queue" {
      [33m~[0m[0m custom_dns_configs            = [] -> (known after apply)
      [33m~[0m[0m id                            = "/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/mydmgmt-dev-governance-rg/providers/Microsoft.Network/privateEndpoints/mydmgmt-dev-pview001-ing-queue-pe" -> (known after apply)
        name                          = "mydmgmt-dev-pview001-ing-queue-pe"
      [33m~[0m[0m network_interface             = [
          [31m-[0m[0m {
              [31m-[0m[0m id   = "/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/mydmgmt-dev-governance-rg/providers/Microsoft.Network/networkInterfaces/mydmgmt-dev-pview001-ing-queue-nic"
              [31m-[0m[0m name = "mydmgmt-dev-pview001-ing-queue-nic"
            },
        ] -> (known after apply)
      [33m~[0m[0m private_dns_zone_configs      = [
          [31m-[0m[0m {
              [31m-[0m[0m id                  = "/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/mydmgmt-dev-governance-rg/providers/Microsoft.Network/privateEndpoints/mydmgmt-dev-pview001-ing-queue-pe/privateDnsZoneGroups/mydmgmt-dev-pview001-arecord/privateDnsZoneConfigs/privatelink.queue.core.windows.net"
              [31m-[0m[0m name                = "privatelink.queue.core.windows.net"
              [31m-[0m[0m private_dns_zone_id = "/subscriptions/e82c5267-9dc4-4f45-ac13-abdd5e130d27/resourceGroups/ptt-dev-privatedns-rg/providers/Microsoft.Network/privateDnsZones/privatelink.queue.core.windows.net"
              [31m-[0m[0m record_sets         = []
            },
        ] -> (known after apply)
      [31m-[0m[0m tags                          = {} [90m-> null[0m[0m
        [90m# (4 unchanged attributes hidden)[0m[0m

      [33m~[0m[0m private_dns_zone_group {
          [33m~[0m[0m id                   = "/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/mydmgmt-dev-governance-rg/providers/Microsoft.Network/privateEndpoints/mydmgmt-dev-pview001-ing-queue-pe/privateDnsZoneGroups/mydmgmt-dev-pview001-arecord" -> (known after apply)
            name                 = "mydmgmt-dev-pview001-arecord"
            [90m# (1 unchanged attribute hidden)[0m[0m
        }

      [33m~[0m[0m private_service_connection {
            name                              = "mydmgmt-dev-pview001-ing-queue-svc"
          [33m~[0m[0m private_connection_resource_id    = "/subscriptions/c86abcfa-2ad1-43ec-8412-4ac039399029/resourceGroups/ingestion-storage-rg-westus-0/providers/Microsoft.Storage/storageAccounts/ingestionwusxsmjetv" -> (known after apply) [31m# forces replacement[0m[0m
          [33m~[0m[0m private_ip_address                = "10.1.0.11" -> (known after apply)
            [90m# (4 unchanged attributes hidden)[0m[0m
        }
    }

[1m  # module.data_management_zone.module.synapse_private_link_hub.azurerm_private_endpoint.private_endpoint_synapse_private_link_hub_web[0m must be [1m[31mreplaced[0m
[0m[31m-[0m/[32m+[0m[0m resource "azurerm_private_endpoint" "private_endpoint_synapse_private_link_hub_web" {
      [33m~[0m[0m custom_dns_configs            = [] -> (known after apply)
      [33m~[0m[0m id                            = "/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/mydmgmt-dev-consumption-syn-rg/providers/Microsoft.Network/privateEndpoints/mydmgmtdevsynplh001-web-pe" -> (known after apply)
        name                          = "mydmgmtdevsynplh001-web-pe"
      [33m~[0m[0m network_interface             = [
          [31m-[0m[0m {
              [31m-[0m[0m id   = "/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/mydmgmt-dev-consumption-syn-rg/providers/Microsoft.Network/networkInterfaces/mydmgmtdevsynplh001-web-nic"
              [31m-[0m[0m name = "mydmgmtdevsynplh001-web-nic"
            },
        ] -> (known after apply)
      [33m~[0m[0m private_dns_zone_configs      = [
          [31m-[0m[0m {
              [31m-[0m[0m id                  = "/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/mydmgmt-dev-consumption-syn-rg/providers/Microsoft.Network/privateEndpoints/mydmgmtdevsynplh001-web-pe/privateDnsZoneGroups/mydmgmtdevsynplh001-arecord/privateDnsZoneConfigs/privatelink.azuresynapse.net"
              [31m-[0m[0m name                = "privatelink.azuresynapse.net"
              [31m-[0m[0m private_dns_zone_id = "/subscriptions/e82c5267-9dc4-4f45-ac13-abdd5e130d27/resourceGroups/ptt-dev-privatedns-rg/providers/Microsoft.Network/privateDnsZones/privatelink.azuresynapse.net"
              [31m-[0m[0m record_sets         = [
                  [31m-[0m[0m {
                      [31m-[0m[0m fqdn         = "web.privatelink.azuresynapse.net"
                      [31m-[0m[0m ip_addresses = [
                          [31m-[0m[0m "10.1.0.4",
                        ]
                      [31m-[0m[0m name         = "web"
                      [31m-[0m[0m ttl          = 10
                      [31m-[0m[0m type         = "A"
                    },
                ]
            },
        ] -> (known after apply)
      [33m~[0m[0m resource_group_name           = "mydmgmt-dev-consumption-syn-rg" [33m->[0m[0m "mydmgmt-dev-connectivity-syn-rg" [31m# forces replacement[0m[0m
      [31m-[0m[0m tags                          = {} [90m-> null[0m[0m
        [90m# (3 unchanged attributes hidden)[0m[0m

      [33m~[0m[0m private_dns_zone_group {
          [33m~[0m[0m id                   = "/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/mydmgmt-dev-consumption-syn-rg/providers/Microsoft.Network/privateEndpoints/mydmgmtdevsynplh001-web-pe/privateDnsZoneGroups/mydmgmtdevsynplh001-arecord" -> (known after apply)
            name                 = "mydmgmtdevsynplh001-arecord"
            [90m# (1 unchanged attribute hidden)[0m[0m
        }

      [33m~[0m[0m private_service_connection {
            name                              = "mydmgmtdevsynplh001-web-svc"
          [33m~[0m[0m private_connection_resource_id    = "/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/mydmgmt-dev-consumption-syn-rg/providers/Microsoft.Synapse/privateLinkHubs/mydmgmtdevsynplh001" -> (known after apply) [31m# forces replacement[0m[0m
          [33m~[0m[0m private_ip_address                = "10.1.0.4" -> (known after apply)
            [90m# (4 unchanged attributes hidden)[0m[0m
        }
    }

[1m  # module.data_management_zone.module.synapse_private_link_hub.azurerm_synapse_private_link_hub.synapse_private_link_hub[0m must be [1m[31mreplaced[0m
[0m[31m-[0m/[32m+[0m[0m resource "azurerm_synapse_private_link_hub" "synapse_private_link_hub" {
      [33m~[0m[0m id                  = "/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/mydmgmt-dev-consumption-syn-rg/providers/Microsoft.Synapse/privateLinkHubs/mydmgmtdevsynplh001" -> (known after apply)
        name                = "mydmgmtdevsynplh001"
      [33m~[0m[0m resource_group_name = "mydmgmt-dev-consumption-syn-rg" [33m->[0m[0m "mydmgmt-dev-connectivity-syn-rg" [31m# forces replacement[0m[0m
      [31m-[0m[0m tags                = {} [90m-> null[0m[0m
        [90m# (1 unchanged attribute hidden)[0m[0m
    }

[1mPlan:[0m 23 to add, 2 to change, 23 to destroy.
[0m[90m
─────────────────────────────────────────────────────────────────────────────[0m

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...

```

</details>